[{"title":"Understanding Business Development","url":"http://sethgodin.typepad.com/seths_blog/2009/09/understanding-business-development.html","body":""},{"title":"What are different types of Marketing Research?","url":"http://whatismarketresearch.com/market-research-types/what-are-different-types-of-marketing-research/","body":""},{"title":"5 Low-Cost Marketing Research Techniques for Small Businesses","url":"https://www.credibly.com/incredibly/5-low-cost-marketing-research-techniques-small-businesses/","body":""},{"title":"Are Product Managers the New Software Engineers?","url":"https://hired.com/blog/highlights/product-managers-new-software-engineers/","body":""},{"title":"500 Startups: The How-To Guide for Finding Product Market Fit","url":"https://medium.com/founder-playbook/500-startups-the-how-to-guide-for-finding-product-market-fit-878c91b20343","body":""},{"title":"COMPETITIVE ANALYSIS PART 2: HOW TO ANALYZE COMPETITIVE INFORMATION","url":"https://www.campaigncreators.com/blog/competitive-analysis-how-to-analyze-competitive-information","body":""},{"title":"7 TECHNICAL SKILLS ALL GROWTH HACKERS SHOULD LEARN","url":"https://buckfiftymba.com/7-technical-skills-growth-marketing/","body":""},{"title":"The Importance of Lead Generation","url":"https://criteriaforsuccess.com/the-importance-of-lead-generation/","body":""},{"title":"Market Research","url":"https://www.entrepreneur.com/encyclopedia/market-research","body":""},{"title":"KANBAN AND AGILE","url":"https://leankit.com/learn/kanban/kanban-agile/","body":""},{"title":"Product Development: Turning Months Into Weeks","url":"http://www.mindtheproduct.com/2017/07/product-development-turning-months-weeks/","body":"Product Development: Turning Months Into Weeks\r\n\r\nBY JAMES DOYLE ON JULY 11, 2017\r\n\r\nHow quickly your definition of “ambitious” can change. Five years ago getting a dog, starting a web company, working on huge projects here at Invoke all would have seemed hugely ambitious to me, but I’ve done them all.\r\n\r\nBuilding an effective real-time chat that syncs perfectly between consumers and supports e-commerce would have been ambitious five years ago. But we’ve just pulled it off in under a month.\r\n\r\nWe’ve built a consumer-to-consumer (C2C) platform that, through chat, enables users to discuss their purchase, make offers, and determine shipping methods. They can accept the terms, and even generate an invoice. They can conduct business with each other without ever leaving the chat. In the past, building a chat like this would be an incredibly ambitious endeavour. But, thanks to newly available technologies, it was easy for us too.\r\n\r\nSimpler, Faster, Better\r\n\r\nIn the past, you would have needed to invest in some serious servers and work some sort of event-polling magic if you wanted your chat to have a chance of feeling nice and snappy. Now, we live in the good times. There are options like websockets and webRTC to choose from, but we opted for a service we’ve used on other projects: Google Firebase.\r\n\r\nFirebase is a service for creating and syncing a real-time database across clients. One user makes a change and everyone else sees it. For our app, a user can immediately see when another user has added a message. All our data is organized in a relatively flat structure—purposefully duplicating the data we think we’ll need to make for simpler data queries. Simpler means faster, and faster means a better user experience.\r\n\r\nBut what really sells it for us is just how easy it is to get started. The fantastic features and vibrant development community surrounding Firebase make getting your product launched that much more efficient – in fact some large companies have also taken note and are using it. If you’ve ever wondered what song was playing and decided to fire up Shazam, you’ve used this tech too.\r\n\r\nA World of Integrations\r\n\r\nThe scale and community investment that comes from a Google service like Firebase means that not only do you benefit from the core features of the service, you can also easily connect and integrate with other tools. This lets us tackle complex problems at lightning speed.\r\n\r\nWe needed to be able to let users know when they have unread messages. For this, we used the Amazon Elastic Beanstalk service to deploy a Node.js server. And wouldn’t you know it, Node.js has a Firebase adapter. When it is connected to our database, it listens for changes. When it notices a new message, it stamps it with the time and marks it as unread.\r\n\r\nNot only did this help us quickly to let users know about unread messages, but the Elastic Beanstalk service also helps us mitigate any problems we might accidentally create at our end. The “eb” command line tool makes updating code a breeze by stamping each update as a release. That way, if someone accidentally pushes buggy code to the live site, we tap a button and things revert back to normal.\r\n\r\nThis reversion capability reduces our risk and lets us frequently update and refine the products that are being powered by these tools and services. With ongoing user feedback and analytics to base our decisions on, a release isn’t a big deal. We can just do it.\r\n\r\nCut the Costs\r\n\r\nNew technologies aren’t just making things faster, easier, and less risky, they’re also making them cheaper.\r\n\r\nThe chat product we built uses Lambda functions from AWS to schedule emails. Lambda lets us create a schedule that emails our users with any unread messages in their conversations. Why does this matter? It’s because this takes advantage of “on-demand computing.” Instead of paying to run a server 24/7/365, we only pay every few hours when our function runs. It’s the sharing economy of computing, and it can drastically reduce the costs required to run a modern service. In a lot of cases, this could be by over 80%.\r\n\r\nSo what has the development taught us? We’ve seen that technology solutions like Firebase, Elastic Beanstalk, and Lambda are making the development teams building products happier, but the benefits extend across product teams.\r\n\r\nWhen launches happen quicker, strategy and design teams can analyze how users interact with the product that much sooner and make improvements even faster.\r\n\r\nIt also means that funding and budgets are freed up to let developers test and refine code. Designers can conduct user tests, and strategists can validate product directions and roadmaps.\r\n\r\nAbove all, it means that it’s now that much easier to determine exactly where our product is, and what new heights we’ll be able to reach next.\r\n\r\nShare Share Email +1 Shares 157"},{"title":" Mergers and Acquisitions: A Complete Guide ","url":"https://www.cleverism.com/mergers-and-acquisitions-complete-guide/","body":""},{"title":"What is Growth Hacking and How to Use it for Your Startup","url":"http://FI.co/posts/31391","body":"With digital media always changing, it's important for startups to constantly keep abreast of the best marketing strategies. And that's why marketing expert and friend of the Founder Institute Shivankit Arora has written this guest post that outlines the basic strategies a startup can employ to increase their internet presence.\r\n\r\nGrowth hacking has been riding the tide in the startup world for a while. While the phrase has been used by marketers more often than before, most of them still limit the concept to search engine optimization, email automation and social media marketing strategy etc.\r\n\r\nHowever, this is not what defines growth hacking.\r\n\r\nGrowth Hacking refers to a set of marketing channels that will trigger your business growth in a data driven and cost effective fashion. A successful growth hack comprises the following:\r\n\r\nBrainstorming and experimenting with a number of hypotheses to come down to a marketing strategy to take your startup to the next level.\r\n\r\nContinuously optimising your efforts, CPAs and and user retention with the discovered hacks.\r\n\r\nNow that we understand what growth hacking is all about let’s have a look into the growth hacking funnel or what it is popularly known as “startup marketing funnel”.\r\n\r\nGrowth Hacking Funnel\r\n\r\nThe growth hacking funnel for startup marketing comprises of 5 stages based on the AARRR model.\r\n\r\nImage Source: Referral Saasquatch\r\n\r\nAcquisition: For startup or a small business, this stage is where you gain the necessary awareness among your target audience to see results from your marketing efforts. Activation: Now that your audience knows about your business and the services/products you have to offer, it’s time to convert them into customers. This stage helps you take your audience closer to the ‘customer’ stage. Retention: The market is where you meet your competitors. However, there’s must be something that gives you an edge over others. This is the stage where you tap into your USP to convince your customer to keep using your product or service instead of multiple options available in the market. Referral: It wouldn’t be wrong to say that ‘word of mouth’ marketing is the best form of marketing out there. This is the stage that deals with getting more customers out of your existing set of customers. Revenue: This is the end result achieved after optimised execution of all the above steps. Here you need to understand how your business will maintain a healthy cash flow with rising profit margin.\r\n\r\nNow that we have a basic understanding of the startup marketing funnel, let’s dive into some these stages with examples from popular startups.\r\n\r\n1. Acquisition: How Airbnb generates the right awareness for their product\r\n\r\nThe founders of Airbnb, Brian Chesky and Joe Gebbia, had just raised some initial funds for their business. However soon they started brainstorming better ways to scale their business rather than the current way of paid acquisition.\r\n\r\nThey began by narrowing down their market research to one basic question.\r\n\r\nWhat are the digital channels where there target audience searches for something more than just a standard hotel experience?\r\n\r\nCraigslist was the answer.\r\n\r\nThe next thing that Airbnb had under their radar was to get their listings on Craigslist too. This would help them get more traction for their own listings.\r\n\r\nThe results?\r\n\r\nUsing this hack, Airbnb managed to pull in thousands of users from Craigslist. Moreover, since their listings were much more comprehensive aided with better descriptions and photographs than Craigslist, the idea led to a viral growth cycle.\r\n\r\nImage Source: Growth Hackers\r\n\r\n2. Activation: How to activate users, the ‘PayPal style’\r\n\r\nPayPal grew to 5 million users in summer 2000 from 1 million users in March 2000. This is one of the reasons why it is one of the most growth-oriented startup of the late 1990s.\r\n\r\nThe first step they took to trigger growth is activate users by paying them to sign up. With every sign up, you were credited $20 (apart from $20 for a referral). Over a period of time as the number of signups boomed exponentially, they reduced the bonus offered, eventually fropping down to nothing.\r\n\r\nThis way PayPal makes a classic example of activating users by awarding them adaptive incentives. While the company did invest in varied advertising practises, the above method was the best hack to achieve lowest CAC.\r\n\r\nImage Source: Quora\r\n\r\n3. Retention: How Groove pulled down their churn rate by 71%\r\n\r\nOne of the major obstacles every SaaS company faces is high churn rates. Churn rate is nothing but the percentage of people exiting out of your subscription based business.\r\n\r\nGroove was one of them. Groove is an easy to use help desk software for businesses coming at $15 per user.\r\n\r\nAlthough the company had a healthy flow of new users, Groove’s 4.5% churn rate was gradually turning the business model on an unsustainable path.\r\n\r\nSo the folks at Groove analyzed users who stayed on-board for more than 30 days and the ones who quit before that. They divided people in the following categories:\r\n\r\nAT the end of a lot of brainstorming, Groove made up its mind to send targeted emails to people who spent less time on the platform or/and were likely to opt out after 30 days period.\r\n\r\nPeople who were spending less than 2 minutes on the site in one session were sent this message:\r\n\r\nImage Source: Kissmetrics\r\n\r\nFor someone who checked in fewer than 2 times in the first 10 days was sent the following message:\r\n\r\nImage Source: Kissmetrics\r\n\r\nThe results?\r\n\r\nThis conversion optimization strategy, helped Groove reduce their churn rate by as much as 71%.\r\n\r\nUnderstanding the point where your users struggle while using your product/service and addressing the same could just save the day for you.\r\n\r\n4. Referral: Dropbox fueled their growth by tapping into referral marketing\r\n\r\nThe success mantra for Dropbox to be one of the most popular tech startups is tapping into the power of referral marketing.\r\n\r\nWith a paid marketing campaign under progress, Dropbox spent $250 per customer for a product that was priced at $99.\r\n\r\nEvery friend you referred Dropbox to, was in turn credited with 500 MB additional storage. You got to earn up to 16GB of free space using this hack.\r\n\r\nImage Source : Referral Candy\r\n\r\nThe next thing they gave attention to was making sure the referral process was as smooth as possible.\r\n\r\nImage Source: Referral Candy\r\n\r\nThe key takeaway here is that ‘word of mouth’ marketing is a powerful hack to pull in more users/traffic on-board. Incorporating referral signups/purchases in your business model with complementary incentives for customers can trigger growth.\r\n\r\n5. Revenue: The growth engine of PicMonkey\r\n\r\nPicMonkey is a company in the photo editing space. But their share of growth hack involves building a great product with a freemium model.\r\n\r\nWhile millions of users were joining in, every month they were editing billions of photos using PicMonkey. While they could access basic filters for free, advanced filters and tools were available for a monthly fee of $4.99.\r\n\r\nIn addition to this, hundreds of thousands of users pay that subscription price.\r\n\r\nImage Source: Fortune\r\n\r\nThe company has been riding the tide of increasing profits ever since, with the exact growth being 40% year over year.\r\n\r\nThe major takeaway here is that going freemium could be the ultimate growth hack for your business. Offering a part of your service as free is a way of educating them how good your product is and in turn assuring them of the value they’ll get once they purchase the premium product/service.\r\n\r\nIn a nutshell, growth hacking isn’t just about SEO or social media marketing. It comprises of an optimised mix of digital marketing strategies and tools that can pull in significant traction for your business in a cost-effective way.\r\n\r\nAbout the Author\r\n\r\nShivankit Arora is a growth hacker and the founder of a startup marketing agency, MarketingMasala.com. You can connect with him on Twitter to know more about growth hacking and startup marketing."},{"title":"The Trick to Viral Growth","url":"https://bigthink.com/cue-the-future/the-trick-to-viral-growth","body":""},{"title":"In Search of the Hybrid Ideal","url":"https://ssir.org/articles/entry/in_search_of_the_hybrid_ideal","body":""},{"title":"The Beginner’s Guide to Defining Buyer Personas","url":"https://digitalmarketinginstitute.com/blog/2017-4-27-the-beginners-guide-to-defining-buyer-personas","body":""},{"title":"Don’t Build a Business Unless You’re Ready to Give Your All","url":"http://FI.co/posts/28951","body":"Adeo Ressi, the co-founder and CEO of the Founder Institute, is a major proponent of perseverence as an entrepreneurial virtue. Because so many aspiring founders, unfortunately, believe that launching a company is easy and is an effective means to gain money and fame, Adeo, along with those of the rest of us at the Founder Institute, have set out to prove that only the most passionate, dedicated, and resourceful will have what it takes to survive in the startup world.\r\n\r\nAdeo recently wrote an article about the topic of commitment in the Forbes article, \"A Business Is Not Worth Building Unless You Are Ready To 'Go All In'\". Below are some of the key points.\r\n\r\nI’ve started 9 businesses and have invested all of my time, all of my network, and most of my money into each and every one of them. Most have done well and others have failed, but I wouldn’t advise an entrepreneur trying to build an impactful company to pursue any other strategy.\r\n\r\nHere’s why:\r\n\r\n1. Building an Impactful Company Requires 100% of Your Time\r\n\r\nI am always surprised by how many founders tell me things like “I can’t quit my job to build this business until I get some funding.” This line of thinking of completely backwards, and naive. What investor in their right mind would take the risk of investing in your company if you (the founder) won’t even take on the risk of future earnings to devote your time to it? Realistically, the founders that tell me this are hundreds of steps away from getting investment – but even then, do they really expect talented people to go out on a limb to join their team full-time if they’re not willing to do the same? Unless you have an amazing track record in entrepreneurship, this is non-negotiable.\r\n\r\nTo be clear, I am not saying that a business can’t begin as a “side-project”. On the contrary, I believe starting a “side-project” before fully committing is the absolute best way to start a company. When it is just a “project” (not a “business”), you aren’t too attached to it, and you can look at things objectively while testing the idea with customers, researching the economics, and getting feedback from experts.\r\n\r\nHowever, once you have put in several months (at least) and have gotten the proper validation, you need to devote 100% of your time to build the business if you want to have any chance of success. Realistically, this means 60+ hours per week for several years.\r\n\r\n2. Building an Impactful Company Requires 100% of Your Network\r\n\r\nIf you are trying to build something of impact, then you need to quickly get comfortable with asking your friends, family, and colleagues for favors. These favors include, but are not limited to, sharing your news, giving you feedback on your product, providing introductions, handing over money (buying your product/ investing in your company), and more.\r\n\r\nAs awkward as this may seem, there is really no getting around it. As an early-stage entrepreneur you usually have no tangible product to sell, so all you can sell is a vision or idea. This is actually very similar to a politician starting a “movement” – and a “movement” requires an initial audience to get it going.\r\n\r\nTo force this thinking on early-stage entrepreneurs that are not quite ready to go “all-in”, in the first week of the Founder Institute we mandate that our founders create a mailing list of at least 20 friends, family members, and associates. After sending an initial introductory email where people can silently opt-out, the founders then send this mailing list business updates and requests for feedback on a weekly basis. To push things further, we even require our founders to add people to the list every week, and when they finish our program they have over 125 subscribed contacts that they know personally or met in the program.\r\n\r\nIs this overkill? To be honest, when we first implemented this strategy the required subscriber numbers were much lower. However, over time we have moved the requirements higher and higher because it has be so effective. At the end of the day, this simple mailing list has acted as a forcing function that not only gets our founders comfortable with selling to personal acquaintances, but also provides them with a wide net of people from which to get valuable feedback, spread news, and more.\r\n\r\nIf you are not comfortable asking friends, family and colleagues for favors related to your business, then I suggest you do something similar. Trying to build your company alone is usually a fool’s errand.\r\n\r\n3. Building an Impactful Company Might Require All of Your Own Money\r\n\r\nIt does not always require 100% of your money, like numbers 1 and 2 above… but it might.\r\n\r\nThis is what startup people call “skin in the game”. Joining, investing in, or partnering with a startup is always a question of risk management, and the most remedial question someone can ask to mitigate risk before working with you is “Are you committed?”.\r\n\r\nThere is a difference between interest and commitment. When you’re interested in something, you do it only when it’s convenient. When you’re committed to something, you accept no excuses, only results.” – Kenneth H. Blanchard (Author of The One Minute Manager)\r\n\r\nMost of the successful entrepreneurs you read about today have invested most of their money into their businesses at the early stage, while also taking either a very low or the legal minimum salary for the first several years. I have done the same with all nine of my businesses.\r\n\r\nObviously not everyone has the luxury to do this, but at the very least, they should expect to front the initial costs of the business (incorporation, legal, basic technology/materials, and the like), while also offering much higher salaries to their first key hires than their own. After all – what signifies more commitment from the founder than cold hard cash?\r\n\r\nOkay, so let’s say you have read my three points above but are still wavering and not quite ready to go “all-in” with your time, network, or money. What should you do?\r\n\r\nAt the very least, I recommend that you take a step back and ask yourself two key questions:\r\n\r\nAm I fully committed to this idea?\r\n\r\nIf you are ready to go all-in but do not believe you have validated your idea, you can usually find the answer by (1) isolating your area of concern, (2) getting feedback on it through a well-constructed “MVP Test” with a few hundred more potential customers, and (3) reviewing the results with someone that successfully built a business targeting the same customer. If you are not sold after that, then it’s time to significantly alter (“pivot”) your idea, or start over altogether. Keep in mind that this is not a bad thing – it is better you learn this sooner rather than later.\r\n\r\nAm I ready for the rigors of starting a business?\r\n\r\nIf you believe you have validated your idea but are still not ready to go all-in, then work backwards and create a plan that will get you to that point. Maybe you have a child on the way, or other family obligations on the horizon? Maybe you need to save up money and start another “side-hustle” in the interim? Or, maybe you need to take time creating relationships that will be crucial for your business to succeed? Whatever the situation, just create an actionable plan to get you there as quickly as possible. I promise you that the longer you wait, the more your chances of getting started and succeeding diminish.\r\n\r\n(Business woman looking at road that goes up in the sky concept image by Shutterstock)"},{"title":"Engineering as Marketing-Traction Channel #10","url":"https://startuprunner.com/engineering-marketing-traction-channel-10/","body":""},{"title":"The Core Tenets of Jobs-to-be-Done Theory","url":"https://jobs-to-be-done.com/the-5-tenets-of-jobs-to-be-done-theory-ba58c3a093c1","body":""},{"title":"The 7 (Pitching) Habits of Highly Effective Founders","url":"http://500.co/7-pitching-habits-for-founders","body":"Finding the right investors is like dating — you need to kiss many frogs before you find a prince.\r\n\r\nToday, I’m going to share seven ways fundraising founders can kiss fewer frogs and find more princes (subtle hint: Batch 19 applications are now open).\r\n\r\nHabit 1 – Pitch to the Right Investors\r\n\r\nNot all investors are created equal.\r\n\r\nSome investors only invest in seed investments. Some investors only focus on Series A.\r\n\r\nBefore approaching any investors, do your homework and make sure you go after the right target audience.\r\n\r\nYou can segment them with these 5 characteristics:\r\n\r\nInvestment stages (seed, Series A, B, C, etc.) Check size (e.g. $50,000 – $150,000) How many deals has he or she done in past 6 months (you will find out how active this investor is) Industry focus (if any) Geography (most Silicon Valley investors would not invest outside of the Bay Area)\r\n\r\nIt is certainly quite rare to turn someone who isn’t already engaged in your industry or geography into someone who suddenly cares about what you’ve created.\r\n\r\nHabit 2 – Pitch with Purpose\r\n\r\nMy colleague Andrea Barrica introduced me to this quote by Maya Angelou:\r\n\r\n“I’ve learned that people will forget what you said, people will forget what you did, but people will never forget how you made them feel.”\r\n\r\nWhat do you want your potential investors walk away with after your pitch?\r\n\r\nKeep that in mind and you very likely will change the story you tell and the way you tell it.\r\n\r\nHabit 3 – Curate Your Story\r\n\r\nIt’s harder to tell a short than a long story.\r\n\r\nIt’s easy to tell your investors everything that’s happened in your life since you were 3, but whittling that down to what they really need to know is much harder — and much more compelling.\r\n\r\nDon’t be lazy, or self-indulgent. Put in the extra 20% effort and curate only relevant and story that make you uniquely over qualify for your startup.\r\n\r\nHabit 4 – Pitch like a Professional\r\n\r\nDuring your pitch, you need to convey two things: 1) why you are the most qualified person and 2) why investors should give you money now.\r\n\r\nBe sure to cover the following if you are ready, but always start with traction \u0026 demo if you have it.\r\n\r\nHere are 11 things to cover:\r\n\r\nTraction, traction, traction Revenue User download User engagement Major signed partnerships Product demo (If you have it. You should have it.) Market size \u0026 target market Pain point Product Team (team, investors, advisors) Technology Business model Monetization model Competition Market Trends\r\n\r\nHabit 5 – Understand the Big Picture\r\n\r\nMost founders I met are in love with their product.\r\n\r\nUnfortunately, as an investor, I don’t just want a person who is in love with himself or herself or their product.\r\n\r\nI want a founder who truly understands how to create a business. You should be the one who can tell me everything about your competitors, market, legal environment or policy changes.\r\n\r\nHabit 6 – 24 Hour Follow Up\r\n\r\nAfter your first call or in person meeting, be sure to follow up within 24 hours and make sure to cover the following in your follow up email:\r\n\r\nThank them!\r\n\r\nYour deck\r\n\r\nCurrent traction\r\n\r\nTeam\r\n\r\nAction items\r\n\r\nYour ask\r\n\r\nAsk for follow up meetings or phone calls\r\n\r\nHabit 7 – Show Passion \u0026 Honesty\r\n\r\nBuilding a startup is really, really hard work.\r\n\r\nAs an investor, I want to find someone who won’t back down when things get (even) harder, and is willing to do whatever it takes to make things happen.\r\n\r\nA huge part of working hard — and knowing where to work harder — is knowing what isn’t working (yet).\r\n\r\nShow your true self, and be honest. It’s ok to say, “I don’t know.” You don’t need to have all the answers, but you do need to have the strength of character and work ethic to figure it out."},{"title":"The Behavioural Roadmap for Startups","url":"http://seedcamp.com/resources/the-behavioural-roadmap-for-startups/","body":""},{"title":"Five Smart Exit Strategies","url":"http://www.businessinsider.com/startup-exits-should-be-positive-and-planned-early-2011-1","body":""},{"title":"How Roadmap Week helps us turn big ideas into reality","url":"https://wavelength.asana.com/work-plans-high-level-objectives-roadmap-week/#close","body":"When Asana was a young company of just a few people, we experienced a phenomenon that’s common with early-stage startups. Just about every day, someone would come to work with a new idea. (A good idea, no less!) Most of the time, we said, “let’s do it.” Until we got distracted by the next new idea.\r\n\r\nOn the one hand, it’s hard to make meaningful progress when you’re constantly open to changing strategy. On the other hand, rejecting all new ideas is the opposite of fostering the kind of organization that can learn, adapt, and react quickly.\r\n\r\nThat’s why setting aside time to make meaningful, structured work plans—and then carrying out those plans—is so important. At Asana, we consider the planning process to be just as critical as the execution process. You wouldn’t run a race without a route. Similarly, it’s difficult to run an organization without mapping out clear goals.\r\n\r\nSketching out a roadmap\r\n\r\nThere are many ways to do planning. After years of prototyping our own systems, we’ve landed on a model that works well for us, and that may work well for you too. We structure our calendar into ~4-month periods we call “episodes.” During each episode, we stick to our plans. As new ideas come up, we write them down and table them for later.\r\n\r\nIn between each episode, we hold a weeklong event called Roadmap Week. Roadmap Week is when we reflect, integrate new ideas, and plan just how we’ll carry them out. The whole company comes together for both high-level reflection on how the last episode went, and high-level planning on how the next episode should go. It’s a time to dream big and review all those ideas we wrote down over the past few months. Large strategic pivots are now on the table.\r\n\r\nThe week is driven forward by committees that facilitate a series of meetings focusing on everything from deployment and scalability to metrics and design. We take an honest look back on our successes and failures, discuss our goals and deliverables, map out the next episode’s key milestones, and envision new ways to experiment. Because we consolidate many meetings into that week, we have fewer meetings throughout the rest of the year.\r\n\r\nSometimes people say, “I don’t have time to do these kinds of planning exercises.” We’ve found that we don’t have time not to do these exercises. Without a clear plan, you might find yourself running a race without a route—perhaps quickly, but in the wrong direction.\r\n\r\nUltimately, organizations exist to accomplish goals. Succeeding at those goals comes down to being clear about exactly what you’re trying to accomplish (“clarity of purpose”) and how you’re going to get there (“clarity of plan”).\r\n\r\nHere are some of the major ways we’ve benefited from implementing Roadmap Weeks.\r\n\r\nLearn from your failures.\r\n\r\nWe look carefully at our ideas and goals set forth during our previous Roadmap Week, and inevitably, many of them won’t have come to fruition. That’s okay: You can often learn more from failures than successes. Deconstructing where, and why, something went wrong gives you the chance to both identify warning signs and avoid similar courses of action in the future.\r\n\r\nBut also from your successes.\r\n\r\nOf course, it’s just as important to recognize and celebrate our achievements so we can replicate them elsewhere. Looking at how ideas were implemented successfully means we can use similar approaches that will lead to more successes.\r\n\r\nLean into big, bold ideas.\r\n\r\nRoadmap Week is our chance to look at all of the big ideas that came up during an episode, and evaluate them objectively. In the course of an episode, I personally will generate five new big directions we could take the product; they all look great when they’re shiny and new, but by the time Roadmap Week rolls around, only one of them will seem actually worth pursuing. Once we identify the ideas that have staying power, we sketch out a realistic work plan, and put individual next steps in Asana.\r\n\r\nCollaborate with teams that otherwise wouldn’t work together.\r\n\r\nRoadmap Week is an opportunity to bring together individuals from teams that don’t normally interact day-to-day. It’s a chance to hear from people from different parts of the company, who might have ideas about areas they don’t normally work on. For example, often a product team will present an idea for a feature, and someone from our customer success team will be able to correct their assumptions about what customers actually want from the feature.\r\n\r\nAnticipate problems.\r\n\r\nIn mapping out how to execute a goal, it’s worth brainstorming all the potential roadblocks that could impede you. These obstacles can often be gleaned from past failures. Other times, they’re determined by vividly imagining just how certain scenarios will play out. “Pre-morteming” is surprisingly effective: Pretend it’s four months from now, and the project has failed; what went wrong?\r\n\r\nCapitalize on collective energy.\r\n\r\nRoadmap Week is not only a reset; it’s a time for teammates to come together, celebrate all you’ve accomplished, and enjoy the freedom of open-ended creative exploration. Ideas produce inspiration, and inspiration produces dopamine ;-). It’s a pleasure to harness the collective passion and excitement that comes out of dreaming big, together.\r\n\r\nIf you’re interested in building a framework to create your own Roadmap Week, read our guide to forming successful committees that host productive planning meetings."},{"title":"4 Diverse Work Styles and 3 Ways to Manage Them","url":"https://www.tlnt.com/4-diverse-work-styles-and-3-ways-to-manage-them/","body":""},{"title":"Sprint: Monday","url":"https://library.gv.com/sprint-week-monday-4bf0606b5c81","body":""},{"title":"9 Qualities to Look for in a High-Performing Business Development Professional","url":"https://blog.hubspot.com/agency/9-qualities-every-business-development-professional-should-have","body":""},{"title":"Storytelling as a Business Communication Skill","url":"http://playbook.amanet.org/storytelling-business-communication-skill/","body":""},{"title":"Kanban vs. Scrum: Which Is Better?","url":"https://www.projectmanager.com/blog/kanban-vs-scrum-better","body":""},{"title":"How to Define and Build a Great Organizational Culture in 2018","url":"https://medium.com/the-mission/how-to-define-and-build-a-great-organizational-culture-in-2018-f8b972e433b6","body":""},{"title":"How Netflix does A/B Testing","url":"https://uxdesign.cc/how-netflix-does-a-b-testing-87df9f9bf57c","body":"How Netflix does A/B Testing\r\n\r\nHave you ever wondered why Netflix has such a great streaming experience? Do you want to learn how they completed their homepage plus other UI layout redesigns through A/B testing? If so, then this article is for you!\r\n\r\nI’ll start with sharing my takeaways from a Designers+Geeks event I attended last week at Yelp. The two great speakers Anna Blaylock and Navin Iyengar, both product designers at Netflix, walked through insights gleaned from their years of A/B testing on tens of millions of Netflix members, and showed some relevant examples from the product to help attendees think about their own designs.\r\n\r\nPhoto from the presentation\r\n\r\nExperimentation\r\n\r\nI really liked this first slide of the presentation and think it’s smart to use an image from the TV show “Breaking Bad” to explain the concept of experimentation!\r\n\r\nPhoto from the presentation\r\n\r\nThe Scientific Method\r\n\r\nPhoto from the presentation\r\n\r\nHypothesis\r\n\r\nIn science, a hypothesis is an idea or explanation that you then test through study and experimentation. In design, a theory or guess can also be called a hypothesis.\r\n\r\nPhoto from the presentation\r\n\r\nThe basic idea of a hypothesis is that there is no pre-determined outcome. It is something that can be tested and that those tests can be replicated.\r\n\r\n“The general concept behind A/B testing is to create an experiment with a control group and one or more experimental groups (called “cells” within Netflix) which receive alternative treatments. Each member belongs exclusively to one cell within a given experiment, with one of the cells always designated the “default cell”. This cell represents the control group, which receives the same experience as all Netflix members not in the test.” — Netflix blog\r\n\r\nHere’s how A/B testing is done at Netflix: as soon as the test is live, they track specific metrics of importance. For example, it could be elements like streaming hours and retention. Once the participants have provided enough meaningful conclusions, they move onto the efficacy of each test and define a winner out of the different variations.\r\n\r\nImage from the presentation\r\n\r\nPhoto from the presentation that shows the hypothesis process\r\n\r\nExperiment\r\n\r\nExperimentation is the act of experimenting. Many companies like Netflix run experiments to generate user data. It is also important to take time and effort to organize the experiment properly to ensure that both the type and amount of data is sufficient and available to clarify the questions of interest as efficiently as possible.\r\n\r\nYou probably have noticed that the featured show on the Netflix homepage seems to change whenever you log in. They’re all part of Netflix’s complex experiments to get you to watch their shows.\r\n\r\nHomepage when I logged in the 1st time\r\n\r\nImage from the presentation: the House of Cards page when seen as a signed-out user\r\n\r\nHome page when I logged in the 2nd time\r\n\r\nHome page when I switch the account user name\r\n\r\nHome page when I switch name to kids\r\n\r\nHome page when I’m not signed in\r\n\r\nThe idea of A/B testing is to present different content to different user groups, gather their reactions and use the results to build strategies in the future. According to this blog post written by Netflix engineer Gopal Krishnan:\r\n\r\nIf you don’t capture a member’s attention within 90 seconds, that member will likely lose interest and move onto another activity. Such failed sessions could at times be because we did not show the right content or because we did show the right content but did not provide sufficient evidence as to why our member should watch it.\r\n\r\nNetflix did an experiment back in 2013 to see if they can create a few artwork variants that increase the audience for a title. Here is the result:\r\n\r\nImage from Netflix blog\r\n\r\nIt was an early signal that members are sensitive to artwork changes. It was also a signal that there were better ways they could help Netflix members find the types of stories they were looking for within the Netflix experience.\r\n\r\nNetflix later created a system that automatically grouped artwork that had different aspect ratios, crops, touch ups, localized title treatments but had the same background image. They replicated experiment on their other TV shows to track relative artwork performance. Here are some examples:\r\n\r\nImage from Netflix blog, the two marked images significantly outperformed all others.\r\n\r\nImage from Netflix blog, the last marked images significantly outperformed all others.\r\n\r\nCheck out these two blog posts to learn more about Netflix A/B testing:\r\n\r\nHow Netflix selects the best artwork for videos through A/B testing\r\n\r\nThe Netflix experimentation platform, a service which makes it possible for every Netflix engineering team to implement their A/B tests with the support of a specialized engineering team.\r\n\r\nWhat I learned\r\n\r\nA/B testing is the most reliable way to learn user behaviors. As designers, we should think about our work through the lens of experimentation.\r\n\r\nImage from the presentation: your instinct is not always right\r\n\r\nWhen and why A/B testing\r\n\r\nOnce you have a design in production, use A/B testing to tweak the design and target two key metrics: retention and revenue. By A/B testing changes throughout the product and tracking users over time, you can see whether your change improves retention or increases revenue. If it does, make it the default. In this way A/B testing can be used to continuously improve business metrics. Are your users finding or doing one thing you want them to find or to do?\r\n\r\nMy experience is that often times users cannot always complete a task as fast as you expect, and sometimes they can’t even find a certain button you put on a page. The reasons can vary: it might because the design is not intuitive enough; the color is not vibrant enough; the user is not tech savvy; they don’t know how to make a decision because there are too many options on one page, and so on. Are your intuitions correct?\r\n\r\nSadly, when it comes to user behavior, our intuitions could be wrong, and the only way to prove it is through A/B testing. It is the best way to validate whether one UX design is more effective than another. At work, our consumer product team have proved that through A/B testing on our real estate website. For example, they wanted to figure out whether they can make a design change to improve the registration rate for users who clicked on a Google Ad. They created a few different experimental designs and tested them. They thought the design that only hides the property image would win, but found that the design that hides both the property image and the price got the highest conversation rate. Explore the boundaries\r\n\r\nThe best ideas come from many idea explorations. At work, our product team works collaboratively across many different projects. With so many parties involved (from designers to product managers to developers), we get to explore the boundaries together. Some of the best ideas are sometime from the developers or the product managers after testing out our prototypes. Observe what people do, not what they say\r\n\r\nWhen talking to users, it’s important to keep this in mind: they always say one thing but do it differently. I conducted a few user testing sessions this week and have one perfect example to show you why. I had this one user testing out a Contacts list view prototype and asked him if he usually sorts/filters his Contacts. He said no because he wouldn’t need do so. However, when he discovered the new filters dropdown menu, he was amazed by how convenient it is to sort and filter multiple options at a time and immediately asked when that can roll out in production. Use data to estimate size of opportunity\r\n\r\n• It’s always about the whys\r\n\r\n• Data can help shape ideas\r\n\r\n• Check if any A/B testing are in conflict\r\n\r\nIsn’t it so fun to be a UI and UX designer? :) Knowing your user is the most exciting part of design process! There is no finished design, but many chances for iteration to improve the design and give our users the best experience possible! I enjoy the opportunity to make subtle tweaks for our users, measure their reactions and work with the product team to figure out the next steps.\r\n\r\nIf you like this article, please kindly tap the ❤ button below! :)"},{"title":"How to Deal With Industry Competition","url":"https://www.liveplan.com/blog/2016/12/how-to-deal-with-industry-competition/","body":""},{"title":"The 10 Most Popular Startup Revenue Models","url":"https://fi.co/insight/the-10-most-popular-startup-revenue-models","body":""},{"title":"What is Market Research?","url":"https://www.oberlo.co.uk/ecommerce-wiki/market-research","body":""},{"title":"THE 7 HABITS OF HIGHLY EFFECTIVE STRATEGIC ACCOUNT MANAGERS","url":"https://yesler.com/blog/customer-engagement/the-7-habits-of-highly-effective-strategic-account-managers","body":""},{"title":"The Role of a Product Manager","url":"https://medium.com/swlh/the-role-of-a-product-manager-e0354b4b6845","body":""},{"title":"One Cow Describes Eight Business Models","url":"https://www.businessbacker.com/blog/one-cow-describes-eight-business-models/","body":"One Cow Describes Eight Business Models\r\n\r\nWritten by Jennifer Gueringer // Also shared on Startups.co.\r\n\r\nBusiness theory can be tricky to understand. Leave it to the power of one cow to help you grasp the workings of these popular business models.\r\n\r\nTHE DIRECT SALES MODEL\r\n\r\nA direct sales business operates through a network of salespeople. Typically there is no fixed retail location.\r\n\r\nExamples: Avon, Mary Kay, Traveling Vineyard\r\n\r\nTHE FREEMIUM MODEL\r\n\r\nA business under a freemium model gives away a service at no cost before offering advanced services as add-ons.\r\n\r\nExamples: Dropbox, Hootsuite, MailChimp\r\n\r\nTHE SUBSCRIPTION MODEL\r\n\r\nThe objective of a subscription business model is to retain customers under a long-term contract and secure recurring revenue.\r\n\r\nExamples: Netflix, eHarmony\r\n\r\nTHE FRANCHISE MODEL\r\n\r\nUnder a franchise business model, business owners purchase another organization’s business strategy.\r\n\r\nExamples: McDonald’s, Subway, Starbucks"},{"title":"YOUR BIGGEST COMPETITIVE ADVANTAGES: YOURSELF AND YOUR COMPANY CULTURE","url":"https://startupsventurecapital.com/there-are-really-only-two-substantial-and-sustainable-competitive-advantages-that-are-within-your-d0625c0fbc28","body":"YOUR BIGGEST COMPETITIVE ADVANTAGES: YOURSELF AND YOUR COMPANY CULTURE\r\n\r\nThere are really only two substantial and sustainable competitive advantages that are within your control.\r\n\r\nThey are: 1) You (as Leader) and 2) Your Culture.\r\n\r\nYou’ve heard people say it many times: It all starts with you.\r\n\r\nAs the founder (and CEO) of a new company (talking to startup founders here, but this can also apply to seasoned CEOs) — your job is not just to focus on growing your business, you must also focus on growing yourself. This takes a deep commitment to understanding yourself — how you think, how you act, your strengths, your blind spots, and your leadership gaps. It also takes a deep commitment to working on yourself.\r\n\r\nThe more you invest in your own leadership skills (yes, it’s an investment) — the better you will be at inspiring your people, creating and seizing opportunities, and handling problems and challenges.\r\n\r\nHere are a few things you can do to push yourself towards self-mastery and leadership excellence:\r\n\r\n1. Implement a leadership development plan. Via self-reflection, asking for feedback and/or 360 degree reviews, determine what behaviors or skills you want to improve and then create (and stick to) a plan to do so.\r\n\r\n2. Practice self-care. It is your job to optimize yourself for peak performance and to bring a healthy, creative, and productive YOU to work each day. Building a sustainable life for yourself and your employees is crucial to building a sustainable business.\r\n\r\n3. Hire a coach. Growing yourself into the best leader you can be while also growing your company is hard. Having an accountability and thought partner is a wise investment.\r\n\r\nThe second, sustainable competitive advantage you can create is a strong, positive company culture. Not to beat a dead horse here, but it all begins with you, first and foremost. Leading a company is akin to being a parent — i.e. the kids are watching, and most likely mirroring, everything you do.\r\n\r\nEven when you think no one is paying attention, they are. They are watching what you do to signal what is acceptable behavior — how they should act and interact, if they should burn the midnight oil, if they should treat Mondays like good days, etc.\r\n\r\nThere are many things that go into creating a strong company culture. Here are just a few things you can do to shape and sustain a culture that helps your employees and business to thrive:\r\n\r\n1. Be thoughtful about your company’s core values. No copying and pasting from the websites of the companies you admire most! Have explanations for, and discussions around, what each value means, and then “Walk the Talk” as the leader.\r\n\r\n2. Stay consciously focused on maintaining a foundation of trust. Lead from an authentic place and your team will follow. Trust in the A-team you hired and they will, in turn, trust you and each other.\r\n\r\n3. Promote a culture of learning. Practice and preach growth mindset and develop a feedback-seeking culture by asking for feedback as much as you give it."},{"title":"IS AFFILIATE MARKETING RIGHT FOR YOUR STARTUP?","url":"http://www.nextupasia.com/is-affiliate-marketing-for-startups/","body":""},{"title":"11 Remarkably Effective Ways to Lead by Example","url":"https://www.inc.com/peter-economy/11-surprisingly-effective-ways-to-lead-by-example.html","body":""},{"title":"The 2-Step Facebook Lead Gen Funnel For Local Businesses","url":"https://www.crazyeyemarketing.com/blog/the-2-step-facebook-lead-gen-funnel-for-local-businesses/","body":""},{"title":"When Is It Time to Scale Your Business?","url":"http://www.coxblue.com/when-is-it-time-to-scale-your-business/","body":""},{"title":"7 Steps for More Effective A/B Testing","url":"https://www.usertesting.com/blog/2015/08/20/7-steps-for-more-effective-ab-testing/","body":""},{"title":"The Importance of Market Research to Your Business","url":"https://www.thebalance.com/why-marketing-research-is-important-to-your-business-2296119","body":""},{"title":"5 Steps to Executing the Perfect Sales Prospecting Campaign [+ Templates]","url":"https://blog.hubspot.com/sales/perfect-outbound-sales-plan","body":""},{"title":" Inexpensive Ways to Conduct Marketing Research","url":"http://buzz.greatfxprinting.com/inexpensive-market-research.htm","body":""},{"title":"The Five Types of Virality","url":"https://news.greylock.com/the-five-types-of-virality-8ba42051928d?source=rss----f89b20443665---4","body":"The Five Types of Virality\r\n\r\nand choosing the right one for your product to grow\r\n\r\nEvery entrepreneur has the dream of making their startup’s product go viral. But too often this is couched in a naïve understanding of virality. “Let’s make our app viral!” Or your investors ask you, “Can you take your app and add a little bit more virality?” (I often hear this described as growth hacking, too.)\r\n\r\nSometimes it feels like people believe virality is just magic pixie dust that can be sprinkled on anything. Fortunately, it’s much more concrete than that. But to understand how virality works, you first have to know that not all virality is the same. Many successful companies have done distinct things to help make their products go viral, all in completely different ways. So I thought it would be helpful to try to classify the disparate approaches.\r\n\r\nIf you’re trying to build your company and grow your product, it helps to think as specifically as possible about how to get your product in front of people. You can engineer features that will amplify the chances that people will want to try it. Of course first, you have to make a great product that people love. Once they love it, they’ll talk about it more. But how do you actually feed them the language to talk about it and enhance that word of mouth experience? How do you remind them to talk about it when they’re having a great experience? Or later? You need to understand what’s inside your core users’ minds, and use that knowledge to help them share your product through whatever means makes the most sense.\r\n\r\nDo you need to build incentive programs into your product and marketing plans? Or, if people are making something tangible and shareable with your product, like pictures, how do you get them to share it in a way that other people will be naturally exposed to the product? And then how do you make sure that the flow of interested people actually converts to new users as seamlessly as possible?\r\n\r\nThe most basic element common to all these different types virality is inception. The goal of all viral efforts is to insert (or “incept”) an idea of what a product can do into someone else’s head, and to get them so excited about it they want to try it and use it. That’s the most important component of any type of virality. What is that little sentence, that little hook, that little reason why somebody actually wants to try your product out?\r\n\r\nSo here’s what I’ve found are the five main types ways a product can do this. Do you have another way I didn’t cover here? I’d love to hear about it.\r\n\r\nWord-of-mouth virality\r\n\r\nThis one is straightforward: It’s simply a product being so good that people can’t help telling their friends about it. For example, when Google was just taking off, people would notice you searching on Alta Vista or Infoseek or another search engine and they’d tell you “use Google, the search is so much better.” So the next time you did a search, you’d try it, and pretty soon you’d be telling others about it too.\r\n\r\nA couple of years ago, when we got our first iPhone apps, geeks like me were telling everyone they knew about Evernote, because it lets you sync notes between your computer and your smartphone. It often happened when you’d see someone taking notes on their phone, and they’d tell you they were using Evernote and how simple it was to keep one copy of the notes everywhere.\r\n\r\nOne other key to word of mouth virality is making sure your product is easy to find later. Having a name that is easy to remember, *and to spell* certainly helps (Google is easier than Googol — the number it was named after). Missing vowels and doubled letters, not having the right domain name or app store name always make it trickier. One test I like to do when trying out new company names is check the typeahead in the App Store. If you are calling your application InstaGreatCoolThing, you might realize users typing ahead will see Instagram and similar apps before yours (until you are as big as Instagram).\r\n\r\nThe other key is to make sure your product is easy to describe. The words you use to describe your product — on your home page, in your press messaging, and in the product itself will be the foundation of how your users describe it. This is really important because it’s how your users will incept other users with what your product does. Funny side features like Google’s “I’m feeling lucky” or Facebook’s “Poke” often help to make the description memorable too. If you don’t have a pithy way to describe your product, you should assume your users won’t be able to either.\r\n\r\nIncentivized word-of-mouth virality\r\n\r\nThis is similar to word-of-mouth, but with a little added incentive for people to refer their friends. For instance, 15 years ago, Paypal would give you $10 if you referred a friend and they created an account. Similarly, Dropbox and Uber have used incentives to great effect. Refer a friend and they’ll get more free storage (and you too), or a discount on their first ride.\r\n\r\nIt helps when the incentive works both ways, as a coupon for the new users as well as an reward for the referring user when the recipient creates a new account. Because you are paying for it and discounting your service, it’s not quite as clean or pure as word-of-mouth, but it can be very effective.\r\n\r\nDemonstration virality\r\n\r\nDemonstration virality is when the nature of a product is such that, simply by using it, people are showing it off. One great example is Instagram: In 2010 it was fairly difficult to get photos off your phone and into some useful place, so Instagram added tools for people to easily share their photos out to Twitter, Facebook, and Flickr. Instagram’s filters naturally caught people’s attention on those networks. It provoked an instant “How did you do that?” reaction.\r\n\r\nYou can see Prisma blowing up this summer in the same way. You can create these incredible, stained-glass-like artworks with it, and then share them on Instagram or wherever. Of course people want to know how did you did that, so they’ll ask you — or they can see the little Prisma logo on the image, and then go get the app themselves.\r\n\r\nMusical.ly spreads in a similar way as users and influencers create very cool music videos and then share them on Instagram, Facebook, YouTube, and people decide to try Musical.ly to make their own.\r\n\r\nAnother example is Pinterest. If I create a pinboard of fun GIFs or wedding ideas or recipes, and I share it, the act of sharing is a built-in advertisement for Pinterest’s awesomeness.\r\n\r\nEven Uber benefited from demonstration virality early on. You’d show up to a meeting in a black car and people would be like, “Dude, where did you get the limo?” Or you’d be leaving a party and you’d just press the Uber button and a car showed up for you. Meanwhile, your friends were trying to hail cabs or call for rides. Just by using Uber, you were a walking advertisement for the product and how much better it was.\r\n\r\nInfectious virality\r\n\r\nInfectious virality is when a product is designed in a way that people will work to get other people using it because it will make it better for both of them. It’s when one user is “infecting” another with the virus, I mean the product so that they are both hooked. For example, Snapchat users have a big incentive to encourage their friends to download Snapchat so they can send photos back and forth in a more authentic and safe way. Twitter works the same way: If you follow me on Twitter I’ll have more followers, and you can see what I’m doing and tweeting, and it’ll be great for both of us. Nextdoor is a really interesting example where even though people might not know their neighbors, they can send them postcards to invite them and make the neighborhood community larger and more productive for everyone. And of course LinkedIn and Facebook are the canonical examples of infectious virality where people invited you to be their colleagues or friends on the service.\r\n\r\nInvitations are the key to spreading infectious virality. However — false invitations or overly spammy invitations often have a deleterious effect on virality. When someone invites you to a service only because they invited their entire address book, it doesn’t feel personal or connected. And if you sign up and the person doesn’t even use the product, then the likelihood for the next person to become active diminishes greatly.\r\n\r\nThis is what most people think of as classic virality, because it’s how we’ve seen social networks and communication networks spread. And who doesn’t love the special feeling of being “invited” to a product by their friend? But infectious virality doesn’t and shouldn’t apply to all products. Being invited into a product that isn’t naturally social doesn’t really work. So use this method carefully and make sure it really applies to your product.\r\n\r\nOutbreak virality\r\n\r\nFinally, some things just spread because they’re fun to share, or because they’ve got a lot of popular momentum and people want to look cool by sharing them. YouTube videos blow up because they’re funny, or addictive, and it’s just fun to share them with your friends.\r\n\r\nIn a similar way, Pokémon Go took off this summer in part because everyone was doing it, and it was just fun to tell your friends about it and to participate yourself. Of course, there are other aspects to this game’s success, such as the fact that it was leveraging a very established, beloved brand, but it also benefited from this virtuous circle of fun, popularity, and sharing.\r\n\r\nPutting it all together\r\n\r\nWhen you understand the different tools and that they all work differently, you can design or build virality into your product in a way that’s very natural.\r\n\r\nI often see founders saying something like, “I’m just going to add an invite flow to my product.” That doesn’t work in most cases. If it’s not well positioned and well integrated, an invite flow is just going to produce a bunch of ineffective invites that won’t convert into new users. It might just bring in a bunch of transient users who don’t stick around. You don’t want to try infectious virality unless it really is applicable — that you want each user to bring another user into the product experience so that it will be better for both of them. If your product is about creating content or having experiences that are easy to show off, it’s often much better to focus on demonstration virality. And if your product costs money and has value, an incentivized word of mouth strategy can really pay off.\r\n\r\nWhen you successfully create that moment of inception, and get the idea of your product into someone’s mind, you do need to follow that up with a smooth new-user flow. The person who shows up to your website or the App Store is ready to try it. They are excited to try it and give your product some attention. This is your best chance ever to get them to learn more about what the product does and get it set up for their value. You need to start the onboarding process right so the product has a chance to become a habit, and then for that user to spread it to the next set of people.\r\n\r\nIt’s entirely possible to have mass deception, where you find a good growth hack and get a bunch of people show up and try your product quickly. But if you’ve enticed them for the wrong reason, they don’t actually adopt the product, or if they do, they don’t stick around long enough to feed the next round of viral adoption. So whenever you’re thinking about engineering virality, you need to be sure that it’s reaching the right people, gets them interested for reasons that align with the intrinsic value of your product, and leads them to the right actions.\r\n\r\nI still remember when I was first invited to Snapchat. A friend texted me to join them so we could send funny faces back and forth and they would be deleted. When I joined up, the first thing he did was send me a funny face and we ended up having a lot of fun with it. The viral hook connected directly with my first use. Over time we learned to send a lot more types of communication together and added more and more friends and it took off. But if Snapchat had offered free beer to everyone who signed up for Snapchat, they might have driven a lot of new users even faster, but those people would all be gone as soon as they finished the beer.\r\n\r\nRemember, at the end of the day, there’s only one metric that really matters: How many people are actually using your product. Not downloading it, not clicking on it, not trying it for a day. Actually using it. So your viral techniques all need to be aligned toward the goal of increasing the number of actual users."},{"title":"The Evolution of a Product Manager","url":"http://www.mindtheproduct.com/2017/05/evolution-product-manager-josh-mcwilliam/","body":"The Evolution of a Product Manager – Josh McWilliam\r\n\r\nBY TREMIS SKEETE ON MAY 15, 2017\r\n\r\nJosh McWilliam is a co-founder and Vice President of Product at College Factual. Their mission is to help every student realize their full potential through the best fit education their money can buy. While their focus is on students with the College Factual brand, they also have other brands like Ed.ai (for advisors), Educate.ai (for colleges), and BRIGHT HUB (for teachers).\r\n\r\nIn Josh’s Product Tank NYC presentation, he explains his evolution as a product manager. His roles over the last 15 years have started with engineering and architecture, and moved on from there to product management, and now he oversees product, but also data science, engineering, and UI/UX teams. His current role is best identified as Chief Operating Officer.\r\n\r\nWhat is a Product Manager?\r\n\r\nJosh openly admits that he has struggled at times to truly define the role of product manager. In fact, many people, both outside and inside the product community also struggle with this reality. Knowing that the product manager role is dependent on one’s career background and skills and the industry that one works (among other things), Josh has gone through many different ideas of what product managers should do.\r\n\r\nBuild More Product\r\n\r\nJosh first assumed that his primary responsibilities involved satisfying his stakeholders and releasing lots of features. The problem with that definition, however, was that he had no validation process in place, and his technical focus caused him to ignore things such as marketing. He found himself being angry with stakeholders for failing to validate product ideas, despite doing exactly what he was told. He then realized that while his stakeholders may ask for certain things, his responsibility is to know what will or will not succeed.\r\n\r\nBuild the Right Product the Right way\r\n\r\nNext, Josh began to think about his effectiveness as a product manager more often. He focused on the product-market fit and user testing. At first, things began to work very well. But after a while, he started to realize that product success leads to managing more products, until eventually you start to lose control and become a bottleneck. Deadline pressure leads to making shortcuts, and you find yourself going from being a leader or coach on the team, to being a dictator, which can create friction on a team. Josh learned from his experiences with this that he needed to become scalable.\r\n\r\nJosh discovered that once you start to focus on scalability, the other areas start to work themselves out. You need to start investing in things like systems, automation, feedback loops, and metrics dashboards.\r\n\r\nHow do you Become a Truly Scalable Product Manager?\r\n\r\nJosh’s short answer to that question is: “you can’t.” To be truly scalable, you can’t be a product manager; you need to be a product leader. To become a product leader, you need to start letting things go and sharing them with the rest of your team. Josh explains that many product managers become hoarders of things like:\r\n\r\nVision . A product manager creates and shares their grand vision with the team, whereas a product leader creates a shared vision with the team, and continues to evangelize it.\r\n\r\nUsers. Product managers regularly talk to users, whereas product leaders ensure that the entire team is regularly talking to users.\r\n\r\nLearning. Products managers are always learning, whereas product leaders are always teaching.\r\n\r\nAnswers. Product managers give the right answers, whereas product leaders ask the right questions.\r\n\r\nDecisions. Product managers make all of the decisions, whereas product leaders delegate all of the decisions.\r\n\r\nPower and Control. Product managers retain power and control, whereas product leaders distribute power and control.\r\n\r\nEfforts. Product managers’ direct efforts of those in their company, whereas product leaders inspire efforts of those in their company and beyond.\r\n\r\nIn his conclusion, Josh reminds us that being a product leader is a matter of combining effectiveness and scalability. You need to be building the right products, but also building them the right way and thinking large scale and outside the conventional ways of getting things done. Being a leader is also very much about being a member of your team, rather than overseeing your team. Product managers create products, but product leaders create “movements” or experiences.\r\n\r\nShare Share +1 Email Shares 277"},{"title":"4 Steps to Defining GREAT Metrics for ANY Product","url":"https://hackernoon.com/metrics-game-framework-5e3dce1be8ac","body":""},{"title":"What Jobs-To-Be-Done research can teach you about your users, your product and your company","url":"https://medium.com/@Productized/what-jobs-to-be-done-research-can-teach-you-about-your-users-your-product-and-your-company-b5240089c95b","body":""},{"title":"Is Your Startup Fundable?","url":"http://FI.co/posts/13491","body":"Have you ever wondered what qualities investors look for in a startup to consider it fundable? Benjamin Chong, a partner at Right Click Capital and a Co-Director of the Sydney Founder Institute, has created a three question test to help determine your answer in the article “Three ways to test if your startup is fundable,” on BRW.\r\n\r\nMany entrepreneurs feel their problems will be solved with funding, but being fundable is very different from being in need of funding. Being fundable is all about your startup’s potential to attract financing so you can grow your business. All startup need some kind of funding to survive but not all are considered fundable.\r\n\r\nIs your startup fundable? Read on to see what Benjamin Chong has say on the matter.\r\n\r\n1. Are you solving a real problem?\r\n\r\nWhen launching a startup, keep in mind that your company has to offer a real value to the world, or at least a part of it, before you seek funding. Here are some questions for you to consider:\r\n\r\nWhat is the problem your startup is trying to solve?\r\n\r\nIs it a real problem or a perceived one?\r\n\r\nHave potential customers confirmed you’re solving a real problem?\r\n\r\nWhat’s the market size of the problem?\r\n\r\nLast week, I was presented with an idea for a personal electronic device that could help when paying for items at the cash register. While it was an interesting idea, I couldn’t see a real problem that the device was solving.”\r\n\r\n2. Do you have a killer team?\r\n\r\nGreat minds think alike, so building your startup team is extremely important. Investors look for teams of individuals with a combination of technical background, business skills, and industry experience that are driven to succeed.\r\n\r\nA great way to gain experience is by joining a startup and contributing to the success of a fledgling business. I’ve previously employed-future entrepreneurs, who’ve added immense value to our businesses. At the same time, they’ve gained an understanding of the frenetic pace of an early-stage business and developed skills from financial modelling to phone sales to graphic design.”\r\n\r\n3. Are you gaining traction?\r\n\r\nA startup with little to no traction will not pique the interest of investors. Make sure you are establishing a solid customer base and gaining traction over time. This will help investors determine if your startup is viable. Below are several questions that must be addressed before pushing your startup to the next level:\r\n\r\nDo you have users or customers?\r\n\r\nIs the rate of user growth increasing?\r\n\r\nHave you been able to charge customers for your product or service?"},{"title":"10 Resources to Help You Grow a Lean Startup","url":"https://blog.producthunt.com/10-resources-to-help-you-grow-a-lean-startup-aad02b2354c","body":""},{"title":"From pipes to platforms: Leveraging the network effect","url":"https://inform.tmforum.org/internet-of-everything/2017/04/pipes-platforms-leveraging-network-effect/","body":""},{"title":"Startup advice, briefly","url":"http://blog.samaltman.com/startup-advice-briefly","body":"This is a very short summary with lots left out—here is the long version: http://startupclass.samaltman.com\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nYou should start with an idea, not a company. When it’s just an idea or project, the stakes are lower and you’re more willing to entertain outlandish-sounding but potentially huge ideas. The best way to start a company is to build interesting projects.\r\n\r\nOn the other hand, when you have a “company” that you feel pressure to commit to an idea too quickly. If it’s just a project, you can spend more time finding something great to work on, which is important—if the startup really works, you’ll probably be working on it for a very long time.\r\n\r\nHave at least one technical founder on the team (i.e. someone who can build whatever the company is going to build).\r\n\r\nIn general, prefer a fast-growing market to a large but slow-growing one, especially if you have conviction the fast-growing market is going to be important but others dismiss it as unimportant.\r\n\r\nThe best startup ideas are the ones that seem like bad ideas but are good ideas.\r\n\r\nMake something people want. You can screw up most other things if you get this right; if you don’t, nothing else will save you.\r\n\r\nOnce you’ve shifted from “interesting project” to “company” mode, be decisive and act quickly. Instead of thinking about making a decision over the course of week, think about making it in an hour, and getting it done in the next hour.\r\n\r\nBecome formidable. Also become tough—the road ahead is going to be painful and make you doubt yourself many, many times.\r\n\r\nFigure out a way to get your product in front of users. Start manually (read this: http://www.paulgraham.com/ds.html)\r\n\r\nListen to what your users tell you, improve your product, and then listen again. Keep doing this until you’ve made something some users love (one of the many brilliant Paul Buchheit observations is that it’s better to build something a small number of users love than something a lot of users like). Don’t deceive yourself about whether or not your users actually love your product.\r\n\r\nKeep your burn rate very low until you’re sure you’ve built something people love. The easiest way to do this is hire slowly.\r\n\r\nHave a strategy. Most people don’t. Occasionally take a little bit of time to think about how you’re executing against your strategy. Specifically, remember that someday you need to have a monopoly (in the Peter Thiel sense).\r\n\r\nRead this before you raise money: http://paulgraham.com/fr.html.\r\n\r\nLearn to ask for what you want.\r\n\r\nIgnore what the press says about you, especially if it’s complimentary.\r\n\r\nGenerate revenue early in the life of your company.\r\n\r\nHire the best people you can. However much time you’re spending on this, it’s probably not enough. Give a lot of equity to your employees, and have very high expectations. Smart, effective people are critical to success. Read this: http://blog.samaltman.com/how-to-hire.\r\n\r\nFire people quickly when you make hiring mistakes.\r\n\r\nDon’t work with people you don’t have a good feeling about—this goes for employees (and cofounders), partners, investors, etc.\r\n\r\nFigure out a way to get users at scale (i.e. bite the bullet and learn how sales and marketing work). Incidentally, while it is currently in fashion, spending more than the lifetime value of your users to acquire them is not an acceptable strategy.\r\n\r\nObsess about your growth rate, and never stop. The company will build what the CEO measures. If you ever catch yourself saying “we’re not really focused on growth right now”, think very carefully about the possibility you’re focused on the wrong thing. Also, don’t let yourself be deceived by vanity metrics.\r\n\r\nEventually, the company needs to evolve to become a mission that everyone, but especially the founders, are exceptionally dedicated to. The “missionaries vs. mercenaries” soundbite is overused but true.\r\n\r\nDon’t waste your time on stuff that doesn’t matter (i.e. things other than building your product, talking to your users, growing, etc.). In general, avoid the kind of stuff that might be in a movie about running a startup—meeting with lawyers and accountants, going to lots of conferences, grabbing coffee with people, sitting in lots of meetings, etc. Become a Delaware C Corp (use Clerky or any well-known Silicon Valley law firm) and then get back to work on your product.\r\n\r\nFocus intensely on the things that do matter. Every day, figure out what the 2 or 3 most important things for you to do are. Do those and ignore other distractions. Be a relentless execution machine.\r\n\r\nDo what it takes and don’t make up excuses.\r\n\r\nLearn to manage people. Make sure your employees are happy. Don’t ignore this.\r\n\r\nIn addition to building a great product, if you want to be really successful, you also have to build a great company. So think a lot about your culture.\r\n\r\nDon’t underestimate the importance of personal connections.\r\n\r\nIgnore acquisition interest until you are sure you want to sell. Don’t “check the market”. There is an alternate universe somewhere full of companies that would have been great if they could have just avoided this one mistake. Unfortunately, in this universe, they’re all dead.\r\n\r\nWork really hard. Everyone wants a secret to success other than this; if it exists, I haven’t found it yet.\r\n\r\nKeep doing this for 10 years."},{"title":"CULTURE DEFINITION: IMPROVING YOUR ORGANIZATION’S CULTURE TO GROW AND INNOVATE.","url":"https://www.corporateculturepros.com/culture-definition-revolution-improve-business-innovation-growth/","body":""},{"title":"Product Management Explained in 3 Words","url":"http://spectechular.walkme.com/product-management-explained-in-3-words/","body":"Yes. Just, yes. One of the aspects of design that I must admit to loving, and I am really happy is finally catching on, is the aspect of modern simplicity. Open floor plans for houses, simple and sleek lines on sports cars, and products. The iPhone really started the trend, with a simple yet sleek phone. No need for flip phones with gimmicks. Personally I believe design should be simple and clean, and if you want to make it stand out you should add a subtle change.\r\n\r\nBelow is an infographic by Martin Eriksson that perfectly describes a product manager’s position. As a product manager I need to be business minded, understand the user experience and understand technology. A good product manager understands the aspects of all three circles and must understand how to merge them together. What’s important for you to understand is that product managers don’t need to be the best. There’s a reason that you’re not one whole circle.\r\n\r\nAnother interpretation of the infographic is that you bind them all together. You are the meeting point of all three aspects of your company; you are the intersection in the road. Force all three aspects to look at each other and understand that other aspects exist. Don’t let the circles drift apart but keep them together."},{"title":"Grow fast or die slow: The double-edged sword of M\u0026A","url":"https://www.mckinsey.com/industries/high-tech/our-insights/grow-fast-or-die-slow-the-double-edged-sword-of-m-and-a","body":""},{"title":"Why lead generation is important for your business","url":"https://www.digitalmicdrop.com/2017/08/31/lead-generation-important-business/","body":""},{"title":"The Story Behind How Pocket Hit 20M Users with 20 People | First Round Review","url":"http://firstround.com/review/the-story-behind-how-pocket-hit-20m-users-with-20-people/","body":"If save-for-later service Pocket had a spirit animal, it’d be the American field ant. Like the insect, the startup supports that which is many times its own size. It serves its 20 million registered users — who have saved over 2 billion articles and videos for later — with a team of just 20 employees.\n\nAt the center of this supernatural ability and efficiency is founder and CEO Nate Weiner. Pocket just celebrated its eighth birthday — but for roughly half of the company’s existence, Weiner was the sole employee. On his own, he built and designed Pocket’s website, API, iPhone app and iPad app, and fielded support requests from his first few million users.\n\nPocket is proof that size of team doesn’t equal scale of impact. In this exclusive interview, Weiner explains why scaling a company doesn’t always mean increasing headcount (and burn). Instead, he shares the two ways startups can grow a business without a marketing or sales team, and the incredible advantages of staying small for focus, culture and trust. Any early-stage company that seeks to punch above its weight can benefit from Weiner’s exceptional (in more ways than one) experience with growth.\n\nNearly four years into Pocket, Weiner decided to raise money to turn his one-man-show into a team. How many people would he need? For someone who built the first version of Pocket on his own in a night, five people seemed like a lot. “I asked myself, ‘What the hell would five people do?’” Weiner says. “Evernote (which had made a bid to buy Pocket in its early, early days) employed around 60 people when I first started talking to them. I couldn’t fathom having a team that size. What would they work on? Why’s a team of ten working on what one person can do?”\n\nToday, Pocket is in the process of moving into a new office to fit its now quickly growing team (targeted at two dozen by year-end), so it’s clear that success has shifted Weiner’s perspective, at least a little. Still, he maintains how Pocket’s sustained smaller size in its early years was formative to its long-standing winning streak. And even now, he doesn’t want any sudden moves to lose or dilute the very traits that got the company where it is today: focus and trust. Below, he shares how keeping a team small can be an invaluable guiding principle.\n\nForce Focus with a Smaller Headcount — Either Real or Simulated\n\nManagement mantras harp on the importance of focus and staying nimble for startups. But they tend to leave practitioners to will clarity and agility into reality. Like any other startup, Pocket struggles with staying focused while prioritizing the many inbound or upcoming opportunities it’s always juggling. Unlike most companies, it views its small headcount as a means — not a limitation — to focus.\n\nFor the first quarter of this year, Pocket had over 20 projects on the docket across the entire company — that is, more projects than employees. “Focus is an enduring battle for a company of any size,” says Weiner. “If we were a larger company, we might’ve been tempted to elect a lead for each project, allocate engineers and push ahead on all fronts. But our limited resources prompt frequent reflection and rigorous prioritization.”\n\nPocket only completed one-fourth of its projects slated for the first quarter. With so much in motion, the team felt dispersed and directionless. “It didn't feel good,” says Weiner. “Then we got word of a marquee project: Mozilla wanted to build Pocket into every version of Firefox that people downloaded. That integration caused the entire company to focus on one thing. It took me back to the early days when we were just five people, and how we attacked one goal at a time with all of us behind it. We rallied together to do the integration quickly, all while furthering Pocket’s mission of giving more people access to the content they want for later enjoyment.\"\n\nIf you lead a small startup, ask yourself: restrictions aside, would I put the entire company behind this project? If the answer is yes, find a way to do it. “With everyone on the Firefox project, we moved so much faster, the quality of the product was way better and people were amped up,” says Weiner. “Then we went on to the next project — with more momentum, coordination and energy than if we decided to divide and conquer our list of projects.”\n\nIf you’re over 100 employees, find a way to manufacture the same scenario. Think back to the time when your company could fit into one room, and ask yourself if you’d put everyone on the project if you could. If the answer is yes, consider deploying more reinforcements from your current team. “Even at 20, 30 or even 50 people, you should really just be focused on that one thing that needs to happen right now,” says Weiner.\n\n“I understand that bigger companies cannot shift the same way startups can, but it’s keeping that instinct sharp and active that’s key,” says Weiner. “Personally, I know I need that focus forced on me. The more people you add, the easier it is to keep doing what’s not critically important. With a smaller team, it’s very hard not to stay focused. You constantly need to avoid doing what you want to do in the future for that which has to be done now.”\n\nFor companies of any size, Weiner suggests putting the full team on the most critical project every quarter. “Over the next 90 days, what’s going to be the project that makes the difference? Let’s just make sure that we hit that goal the best we can and then we can move onto the next project.”\n\nPocket is now shortening its project runway to under 30 days — especially for engineering sprints. “I can tell you where we're going six months from now, but we try to focus a month at a time. A small team enables us to operate this way,” says Weiner.\n\nCondense Your Culture But Expand Your Skillset\n\nAt larger companies, entire roles or departments are charged with defining and preserving culture in order to absorb hundreds of new hires. As Pocket’s sole employee for its early years, Weiner was both the only creator and custodian of its culture. While he knew he eventually needed more than one person to scale the company, he didn’t want to lose the drive and grit that had landed him early success.\n\nWith a small headcount, Weiner was able to keep Pocket’s culture concentrated during its formative years. This was possible because its culture wasn’t a fuzzy concept — it meant trust, scrappiness and ownership. Weiner had years to discover and refine founder-culture fit with the same rigor that most apply to find product-market fit for their companies. After all, there’s a saying in tech that 80% of your eventual culture is your founder (literally their personality traits).\n\nThink stews not salads when it comes to company culture. Start by letting a few choice ingredients simmer together. Then taste. You’ll have a better palate for what it delivers and lacks than if you toss it all together from the start.\n\nThis hard-earned clarity allows Weiner to confidently hire in his image while gradually growing the team and diversifying its skillset. “As with all startups, at some point you realize you can’t do it all to completion or to a high standard. For example, I really needed help with design,” said Weiner. “Nikki, our Head of Design, was the first hire. I had the engineering and product experience, but she brought the design chops that we needed to truly make a great product. She changed the black and yellow color scheme — that had somehow looked good to me at the time — to what Pocket looks like today. It's been vital to bring on people who own and value their part of Pocket as much as I have from the start. They’ve made it better than I could have.”\n\nKeeping Pocket around 20 employees has allowed Weiner to not only personally filter for those he can trust, but also assemble a group capable of making decisions and operating without him. With a small team, those bonds and common world view form more quickly without complex hierarchies in the way. “As a technical founder, engineering was the hardest area to let go,” says Weiner. “Early on though, I remember when it finally clicked: We had an issue with our back-end. I suggested an idea on how to resolve it. The team noted it, and then went to another room to sort it out. The solution that they came up with was way better than mine. It was a great moment to realize how it was okay to let go, and that it often turns out better when there’s acknowledged and mutual trust.”\n\nA small startup can use its size to force focus and better preserve culture as it grows, but these benefits are just the fuel for the work the team has to do. Its output — the actual product — can also scale without increasing headcount, but only through two channels. “The only way a product can grow from a team of our size is if your platform carries you or your users carry you,” says Weiner.\n\nThe advantage of being small is that you find ways to make people outside of your walls part of your company.\n\nHere’s how Pocket develops, ships and publicizes its product through its platform and with the help of its loyal users:\n\nHere’s How Your Platform Can Carry You\n\nIn the early days, Weiner made it his goal to embed Pocket in every corner of the web. The intent was to create an “amazing consumption experience” for as many people as possible across all of their devices, which meant the app itself had to be extremely flexible and scalable.\n\nWithout a sales or marketing team, Pocket made its app as simple and straightforward for other companies to learn about and integrate its service — which, in turn, has exponentially grown Pocket’s users. To date, the company has tallied over 2,000 integrations, among them Firefox, Twitter, Flipboard, and Kobo.\n\nWith strong partner feedback and enthusiasm, Pocket now seeks to grow as fast as it can through its platform. Weiner sees tons of opportunities, but there’s more out there than Pocket could possibly build with its current team — even if headcount doubled instantly.\n\nAs a small, fast-growing company, you can go on a hiring spree or lean on your platform. If you opt for the latter, here’s Weiner’s advice:\n\nMake it dead simple and low-lift.\n\nThe team at Pocket relies on this question to make decisions: how can we make it simpler for all involved? For example, it’s now commonplace for startups to share their APIs, but Pocket takes it a step further. “Yes, the APIs that we build on as a company are the exact same APIs we give to every partner publicly. But can you help them with just a few lines of code?” asks Weiner.\n\nYears ago, Weiner took on this challenge with the help of ShareKit, an open source Software Development Kit (SDK) that people could drop into their iOS apps. “I tried to make it literally one line of code for people to add Pocket and other popular services to what they were building.” says Weiner. “Companies could drop the line of code in and their app could share to any service like Twitter, Tumblr or Facebook. At the time, if you had to write the code from scratch on your own, it was weeks of work to set these things up. But I still wanted to make it simpler.” This is the same philosophy that guides Pocket today.\n\nAs much as possible, make it truly plug-and-play for others who want to build in your product. “If Twitter comes to us and wants to integrate Pocket, we’ve lost if it takes them a month to do it,” says Weiner. “They’re simply not going to do it. And I don’t blame them.”\n\nNot requiring people to reinvent the wheel means first making sure what you’re working with is as simple as a wheel. If it is, they’ll use it and there won’t be much reinventing needed.\n\nStructure integration as self-help.\n\nPocket’s platform mentality has been a huge part of its growth. Allowing companies to build on its platform easily has been the first step, but scale happens when they can do so independently. “We’ve completed thousands of integrations without any business development — and the overwhelming majority without any support,” says Weiner.\n\nSimplicity has made it easy for partners to integrate Pocket, but the startup’s size has made it a necessity. “The deals with Kobo and Firefox only happened because we made it easy for them to self-serve,” says Weiner. “At first, Kobo asked us to integrate Pocket in two months. If our team of a dozen people (at the time) had to build it from scratch, it would have never happened. But we said, ‘Here’s our API.' Kobo was able to integrate Pocket within 14 days.”\n\nFor integration, the ideal is when companies can incorporate Pocket without ever reaching out to Weiner or his team. Pocket has found that its users typically request other apps to integrate the save-for-later service, which is what prompts new companies to learn about Pocket. “We’ve heard a few times that the number one feature request for apps is integrating Pocket. When companies look into it, they’re happy to check the request off the list on their own,” says Weiner. “That’s how Facebook Paper integrated Pocket. I had nothing to do with that — I just found out one day.”\n\nWoo big partners tenaciously with your platform, then keep them with transparency.\n\nSimple platform integration and self-service doesn’t mean that startups should go on autopilot. Pocket stays on the radar of strategic companies that it believes will benefit from its product. For example, the first time that Pocket reached out to Firefox it was still known as Read-it-Later. “We started as a Firefox extension and I was one of the extension app reviewers early on,” says Weiner. “We’ve built the type of culture where we share our story, data and updates early and along the way, so companies — from major content services to device manufacturers — understand what it’s like to be our partner from the beginning. We want them to truly know — and be able to point to proof — that we’re ready when they are. One day, it clicked and Mozilla called. It’s now fully integrated Pocket as the save-for-later service for its Firefox browser.”\n\nRemember: getting an app or company on your platform marks the end of a deal, but the beginning of an official working relationship. For Pocket, channeling “generous transparency” is the way it retains its partners and continues to improve its product with such a small team. “We try to share knowledge as much as possible. We don’t try to hide anything. We tell Apple and Google what we’re seeing in the market when they’re working on their share sheets,” says Weiner. “As a result, it's made it really easy for us to actually start getting these deals done as people want to solve their save-for-later needs. They know who to turn to.”\n\nThe takeaway for lean startups is to construct a platform that can enable external parties to operate as extensions of your team: sales, engineering and business intelligence. In the case of Pocket, its platform is simple to integrate, built for self-service and brings with it an increasingly rich set of data, that when aggregated, benefits all its partnering companies. “What’s next is leveraging our user base. While we have a hundreds of companies integrating Pocket, we have millions of users,” says Weiner. “The question now is: how can we serve them and also help them carry us even further?”\n\nHere’s How Your Users Can Carry You\n\n“Think back to what it was like to watch television before DVR or streaming. Or what it felt like to hail a cab without Uber,” says Weiner. “Whenever you find a place that feels old, people get really passionate about it, because the new way has become so core to their experience and going back to the old way just feels broken. With Pocket, I think we’ve hit upon a very different way of using content on the web. We have users that, when they go into another app where they can’t save to Pocket, say, ‘Is this an ancient time? What’s going on here?’”\n\nSmall startups who have users expressing this degree of passion should not miss the opportunity to direct that energy from expression into creation for the benefit of the company. For Pocket, that’s meant getting users to lend a helping hand to product development. Here are the two ways that Pocket’s users are supporting its next generation of products.\n\nShift your Beta channel from delivery to conversation to co-creation.\n\nWhen Pocket started, its release philosophy was about pushing out an airtight product to its users. The team would perfect every pixel before launch. “At the beginning, Pocket was a very waterfall-like product,” says Weiner. “We would deliver big releases about once a year. We’d go underground for six months and build something big and then we'd launch it. The releases were well received, but we suspected we should have been getting more out of our process.’”\n\nYet, after product-market fit, perfect is not only the enemy of good, but of growth. “Pocket is known as a very well-designed experience and app,” says Weiner. “While we want to keep that up, our development debates shifted from every nitpicking detail to how we open up and solve growth problems. As a small team at a growing company, we needed to tap into our users as collaborators, not just as beneficiaries.”\n\nThere comes a point for every startup when you’ve got to decide between perfection and progression. The first is a stable characteristic and the second is a dynamic conversation. Choose wisely.\n\nOff the bat, that means having more frequent interactions with users. Getting them involved in product development isn’t just about opening the floodgates — it requires restructuring the way your team works. Pocket has moved to a faster release cycle to have more touchpoints with its users. “We're moving to a much faster cadence. Our sprints are a few weeks long and we’re closing in on a five to six week release cycle. For the team, it’s a far cry — and a cultural shift — from trying to get everything perfect before the public sees it. Now, we know there are bugs in what we ship, but now we aren’t the only ones squashing them.”\n\nThis approach was especially critical to Pocket 6.0, a prototype that the company uses internally. The team estimated that a full, public-ready version would take nine months to put out. “We were delighted by the beta and didn’t want our limitations to delay our users from experiencing it, too,” says Weiner. “So we decided to break it all apart. We laid out the five to six different releases that’d strategically get us there over a six week release cycle. So far, it’s felt good to get it out there, even if it’s piece by piece. We're getting feedback and signal back really fast. We listen, respond and incorporate it all. We also ship at the same time so users know they’re being heard — they’re like our remote team.\"\n\nIf you have one arrow and you shoot and miss, you're screwed. If you can continually re-aim until you get to the target, that gives you a much better look at the bullseye.\n\nUsed correctly, a Beta channel can give your team great feedback and allow your users to direct the product. Even if you haven’t hired, you’ll feel like you have more manpower to hit milestones and additional insights into fast-moving markets. “After our last fundraise, we set a lot of important milestones, especially around getting additions to the platform built out,” says Weiner. “We know that we want to get them out there to validate and prove them in the market. The sooner that we can do that, the better. The beta channel’s the way forward for Pocket and the way in for our users.”\n\nUse surveys to learn from \"the PMs\" among your users.\n\nFrom the beginning, Weiner was struck by the enthusiasm and loyalty of Pocket users. “Our users love this product. I'm always blown away by how avid and vocal our fans can be,” says Weiner. “We get emails all the time from people writing in to say, ‘Hey. I don't have a bug. I just wanted to tell you guys that you’re awesome.’”\n\nTo fully engage this type of fanbase, use tools to solicit and leverage their support. Pocket has used surveys to not only collect feedback but also to directly guide its product roadmap. “We’re actually just reviewing 600 responses from a survey that we put out in our beta version of Pocket,” says Weiner. “Our support team is having conversations with people directly inside the product. We’ve actually received more feedback than ever through this channel.”\n\nMany startups use surveys as an engagement tool, and casually treat the results as a byproduct. Don’t just listen, really hear what’s being said and how. “I always remind the team to look past the basic gist of the results,” says Weiner.\n\nWhen users give you feedback on an obstacle, they almost always give you an idea on how to solve it.\n\n\"They don’t just say, 'I hate that this is the case.' If you keep reading, they’ll often include, 'You should let me pin this or swipe it away.' It may not be the solution in the end, but it will better define the challenge, which gets you closer to a solution.”\n\nFor example, Pocket now has two tabs, “My List” and “Recommendations,” at the top of the app. Results from the survey indicated that people wanted to swipe between the two lists, but that many users couldn’t reach their finger all the way to the top. “That was insightful, but it was also just one solution,” says Weiner. “The other option may be a standard UI convention on iOS, where you can bring the tab bar down to the bottom. All of sudden now, that's within reach of your thumb. But then, you also have to think about Facebook or other places where the new functionality may not be discoverable for a lot of users and many will have the same problem. If you jump to the first, second or tenth solution, you’re missing the point of fully grasping the need of implementing swipeable tabs.”\n\nLastly, when running surveys, keep in mind these three tips from Weiner:\n\nSegment your users into buckets . Pocket has divided its user base into “casual,” “core,” and “inactive.” The team makes sure to send surveys to a group within each category to ensure they’re learning from a representative sample.\n\nLower the bar for participation . Pocket makes sure its surveys are easy to complete, which means they are less than five minutes long. Oftentimes, they’re even shorter. For the most part, the team prefers releasing two-questions surveys frequently than a ten-question survey released occasionally.\n\nDrop in surveys at multiple junctures. Pocket continues to experiment with where and how it surveys users. Like most apps, there’s a send feedback button (in beta for Pocket) that is a passive channel. Or an email will capture those who may not open the app every day. Also, after five minutes of inactivity in the app, Pocket may pop up with a live chat and ask: “Hey. Everything OK?”\n\nUsing tools to engage users, like surveys and Beta channels, and creating easy, low-lift ways for partners to extend and build on your platform are ways to scale your company without growing your headcount. That’s how Pocket continues to deliver despite its size. However, now that Pocket’s partners and users are becoming more active in shaping the future, they’re also influencing the startup’s definition of success.\n\n“Back before we raised money, I kept saying that save for later is a system-level feature that needs to built into browsers and operating systems. People told me that would never happen. Years later we’re built into Firefox,” says Weiner. “Our strategy has been to first create a way to capture anything you find and want to save — regardless of the app or service — and get embedded with the partners to make that universal. Then it’s to create an amazing set of tools to consume content. This has given us incredible insights on information consumption and, soon, how to solve its challenges. There’s always a next goal, but it’s the same question that drives us: How do we help people get all the great stuff that’s out there?”\n\nThe key for Pocket — or any startup — is to tackle a colossal and ambitious goal with leverage. “Right now, we really want to get our platform to scale even more and reach as many people as possible,” says Weiner. “We want them to not only enjoy what we create, but help us build it. If for each Pocket employee, there’s a hundred partners and millions of users to help, we’ll have the muscle to make it all happen.”"},{"title":"How to Distinguish Between Your Product Roadmap, Product Strategy, and Product Vision","url":"https://community.uservoice.com/blog/how-to-distinguish-between-your-product-roadmap-product-strategy-and-product-vision/","body":""},{"title":"Classification / Types of Mergers","url":"https://efinancemanagement.com/mergers-and-acquisitions/classification-types-of-mergers","body":""},{"title":"Hiring, the Single Most Important Skill as a Founder","url":"https://www.techstars.com/content/accelerators/boston/hiring-the-single-most-important-skill-as-a-founder/","body":""},{"title":"Porter’s Five Forces of Competitive Position Analysis","url":"https://www.cgma.org/resources/tools/essential-tools/porters-five-forces.html","body":""},{"title":"5 insights for improving product development cycle success","url":"https://www.cooper.com/journal/2017/1/5_insights_for_improving_produ","body":""},{"title":"TOP 10 MUST-HAVE SKILLS FOR STARTUP SUCCESS","url":"https://evoma.com/business-centre/top-10-must-have-skills-for-startup-success/","body":""},{"title":"What is Conversion Rate Optimization (CRO) and Why Is It Important?","url":"https://www.invespcro.com/blog/what-is-conversion-rate-optimization/","body":""},{"title":"My Muses for Brainstorming Startup Ideas","url":"http://www.sachinrekhi.com/my-muses-for-brainstorming-startup-ideas","body":"As today marks my first day as an Entrepreneur -in- Residence at Trinity Ventures , I'm spending a lot of time thinking about how to formalize my process for starting a new venture. Every startup goes through phases including brainstorming ideas, selecting evaluation criteria, performing due diligence on top ideas, picking a winner, deciding on a corporate structure , putting together the team, evaluating funding options, and more. While the popular press often glamorizes the startup story as an epiphany moment from an opportunistic individual that grows to a successful corporate behemoth, I prefer a much more systematic approach to entrepreneurship (and life in general, for that matter). As I begin this journey myself, I thought I'd document my new venture process along the way, share it with all of you, and hopefully hear from you on your own thoughts.Often one of the earliest steps in forming a new venture is coming up with the idea. I won't argue that this should necessarily be the first step though, since in my previous venture Anywhere.FM we picked the team before the idea and that was the right choice for us. I also won't argue that it is necessarily the most important step, because while a startup needs a great idea, it's not without great execution that an idea can become a successful endeavor.I'm often asked where I come up with all my ideas, as I'm typically chock-full of potential ideas percolating in my head. I have a variety of sources of inspiration that help me put together laundry lists of potential startup opportunities. Before I dive into my muses though, I think what's important to realize is that the best idea brainstorming happens outside of any specific brainstorming phase. Good idea generation is like a muscle that you are constantly flexing. It's a mindset and attitude towards the problems you face everyday and your ability to effect change. While some people are innately curious and problem solvers, I still think like any muscle, this skill is something that can exercised and improved.I'm personally innately curious. But what has been a huge boon for me was learning to program on my first computer, an Apple IIc , when I was in middle school. I quickly learned BASIC and fell in love with the idea that I could make things. In the early days it was often games to amuse myself (which is what typically attracts many young boys to programming), but as time passed I started making more useful applications. One of the issues I had early on was quizzing myself on vocabulary words. I quickly wrote a program I called Vocabulary Master to provide me random word definitions, give me three attempts to guess the word correctly, and tell me the word if I failed to remember it. It was a very simple application, but was the foundation for my strong belief that I can solve real world problems through software. Ever since then I've constantly had a list of potential ideas. Oftentimes when something bothers me or I think that something can be improved, I add it to a list of potential projects (and I have to say that I love the fact that now I have an iPhone always in my pocket to record my ideas ). It's this critical lens of looking for ways to improve what you see every day and having the attitude that you can do something about it that I think makes for a great base of idea generation.Beyond that, there are specific muses I've used to help jump start my creative juices:I think often the best source of ideas comes from your area of expertise and the problems you face on a day-to-day basis in your career. You probably find yourself saying \"Why is this so hard? There has got to be an easier way\" every so often. It may be a product extension to your existing business's core products, or may be unrelated to the business, but a pain point you feel trying to get your job done. From my experience at imeem focusing on monetization, I've come up with countless pain points in trying to monetize social media and large publisher sites that could be fruitful startup opportunities.I think another very important exercise is analyzing macroeconomic trends and thinking about the opportunities it creates. What obviously comes to mind first these days is the recession, and I think a lot of startup opportunities will come out of that. Anywhere from helping people save money, find jobs, or tapping into the funds made available through the stimulus bill. But beyond the recession, I think there are a lot of other exciting market trends that are creating countless opportunities. Anywhere from the proliferation of APIs , to the rise of cloud platforms , to the opening up of mobile devices I believe there remains significant inefficiency in applying new technologies across multiple vertical applications. It behooves a startup to focus at least initially on a very specific application to prove out the model and to provide the best experience. But this creates significant opportunity for other startups to bring that existing technology innovation to new verticals and thus becomes a fruitful source of startup ideas. I often think about how trends in certain spaces can be applied to new segments. For example, can we bring the viral spreading of applications native to Facebook apps to iPhone applications? Or can we bring the successful virtual goods monetization model from social games to non-gaming sites If you have a specific area of interest or vertical segment that excites you, I think its hugely valuable to constantly keep up with the latest news in that area. These days its so easy to use Google Alerts to subscribe to daily feeds of the latest news, blogs, and search results of your topic of choice. I have these setup for various areas of interest, including open platforms and personal productivity.I think it's also very important to constantly be exposed to new startup ideas. When you hear people's ideas and their take on solving them, it definitely helps to get your own mind thinking about related opportunities in the space or at least helps to think critically about how they may have come up with such a solution. I daily skim TechCrunch as a great source of startup ideas. I think Jessica Livingston's Founders at Work was also a great case study of many different startup ideas.As I said, great entrepreneurs have this ability to constantly come up with ideas and potential solutions. I've been spending the last month catching up with a lot of my fellow entrepreneurs to not only chat about their business, but more importantly, interesting things that they have seen outside of their own startup. When an entrepreneur is busy executing against a specific idea, he is knee deep in one specific space. That doesn't mean though that he doesn't think about other ideas or have other ideas percolating in his head. I think its often great to tap into this creative thinking to spur some of your own ideas."},{"title":"Agile Is The New Waterfall — A Followup","url":"https://medium.com/swlh/agile-is-the-new-waterfall-a-followup-f1c0bcd2162e","body":""},{"title":"DIVERSITY VS. INCLUSION: THE DIFFERENCE BETWEEN THEM … AND WHY BUSINESSES NEED BOTH","url":"https://www.paycom.com/resources/blog/difference-between-diversity-and-inclusion-and-why-you-need-both/","body":""},{"title":"Key Legal Documents for a Startup Company","url":"https://www.startupdecisions.com.sg/startups/launch-and-growth/key-legal-company-documents/","body":""},{"title":"Debugging Recruiting","url":"https://news.greylock.com/debugging-recruiting-9e711654fddb","body":"Debugging Recruiting\r\n\r\nRecruiting great people is a priority for any company at any stage of their growth. In the early stages, finding and hiring your initial team is core to instilling the right company culture. To hire effectively, founders and managers need to be thoughtful and organized about their recruiting process — from the first screening until delivering an offer. A sloppy and inconsistent process reflects poorly on the company, and can be the difference between a “Yes, I want to join” and “No, I don’t think this is the right fit.”\r\n\r\n\r\n\r\nAs a Talent Partner at Greylock, I work with our portfolio and advise them on refining their recruiting processes. As such, I’ve become familiar with many of the common problems that both new and experienced teams face when recruiting.\r\n\r\n\r\n\r\nRecently, I gave a talk that addresses some of these frequent “bugs” in the recruiting process, and want to share my presentation here more broadly. I go over the three stages of recruiting — sourcing, evaluation, and conversion — covering common mistakes made at each level as well as the questions you need to answer to avoid them.\r\n\r\n\r\n\r\nThe full talk will be available on video and podcast soon, but for now here are the slides from my deck. I hope these thoughts and questions are helpful when thinking about your recruiting process:"},{"title":"Market Entry Strategy: Definition \u0026 Example","url":"https://www.mbaskool.com/business-concepts/marketing-and-strategy-terms/7313-market-entry.html","body":""},{"title":"[Pt 2] Selling ‘Jobs to be Done’: Who’s the Customer?","url":"https://medium.com/frameplay/pt-2-selling-jobs-to-be-done-who-s-the-customer-e3a5f80ba527","body":""},{"title":"The right type of customer conversations","url":"https://blog.intercom.com/the-right-type-of-customer-conversations/","body":""},{"title":"4 Ways to Leverage Marketing Trends for Viral Growth","url":"https://www.entrepreneur.com/article/297435","body":""},{"title":"Year-Over-Year Explained With Its Pros and Cons","url":"https://www.thebalance.com/year-over-year-yoy-growth-calculation-definition-3305970","body":""},{"title":"Get to know your user: personas \u0026 jobs to be done.","url":"https://blog.prototypr.io/30dayuxchallenge-day-5-get-to-know-your-user-personas-jobs-to-be-done-d0c272ffed58","body":""},{"title":"Do NOT raise VC funding — The 3 main reasons against it.","url":"https://hackernoon.com/do-not-raise-vc-funding-3-reasons-against-it-7c5f6d4efbec","body":""},{"title":" Creative Ways To Identify New Market Segments","url":"https://www.quicktapsurvey.com/blog/creative-ways-to-identify-new-market-segments/","body":""},{"title":"What is the Product-Market Fit and How to Measure It","url":"https://uxplanet.org/what-is-the-product-market-fit-and-how-to-measure-it-b5bb3db07dae","body":""},{"title":"How Industry Leading Brands Use Content To Drive Lead Generation","url":"https://hub.uberflip.com/lead-generation/how-industry-leading-brands-use-content-to-drive-lead-generation","body":""},{"title":"How to Pick a Co-Founder","url":"https://hbr.org/2011/02/how-to-pick-a-co-founder","body":""},{"title":"Fun is the best driver of viral growth.","url":"https://medium.com/lightspeed-venture-partners/fun-is-the-best-driver-of-viral-growth-664424a41ff7","body":""},{"title":"The 6 Key Traits of Highly Effective Account Managers","url":"https://blog.hubspot.com/agency/traits-account-managers","body":""},{"title":"What Is Lean Startup Methodology – And How Can It Help You?","url":"https://www.startups.co/articles/lean-startup-methodology-can-help","body":""},{"title":"5 Must-Have Skills Startup Founders Can't Live Without","url":"https://www.inc.com/sangram-vajre/5-must-have-skills-startup-founders-cant-live-without.html","body":""},{"title":"What Is Employee Experience?","url":"https://www.forbes.com/sites/jacobmorgan/2016/04/22/what-is-employee-experience/#3297f1e7386c","body":""},{"title":"What Is a Product Manager, Actually?","url":"https://medium.com/@Alex.Valaitis/what-is-a-product-manager-actually-f328f05575","body":""},{"title":"Boxology: The Mythical Science of Organizational Change","url":"http://alignorg.com/library/resource/boxology-the-mythical-science-of-organizational-change/","body":""},{"title":"The Power of Bad Product Ideas","url":"http://www.mindtheproduct.com/2017/03/power-bad-product-ideas","body":"The Power of Bad Product Ideas\r\n\r\nBY CHRIS MASSEY ON MARCH 6, 2017\r\n\r\nSteve Portigal challenges product managers to re-think the idea-generation process by inviting in bad ideas.\r\n\r\nIn brain-storming sessions, we frequently see two surges in ideas. The first is where the low hanging fruit is identified. The second surge is where more innovative ideas are frequently found. Welcoming bad ideas can be an effective strategy for fast tracking past the low hanging fruit and into innovation.\r\n\r\nSteve’s interactive talk encourages product managers to come up with the worst product ideas possible. Not the ideas that are just not that good, but ones that are really, truly terrible. By starting with a bad idea, Steve opens a safe, creative space for ideas sharing. He helps product people to unpack what is good and bad, why and who gets to decide. He encourages us to step away from the binary of good and bad to move around the problem space in a different way. His bad ideas approach also breaks the idea-generation ice – by starting with something terrible, space is opened for all ideas, allowing creativity to flow.\r\n\r\nSharing Terrible Ideas\r\n\r\nSteve identifies two types of bad idea sharing, proactive disruption vs tentative unfinished ideas – and encourages us to recognise and support those who share both. The first type of sharing breaks open space for a different approach to your problem or market. The second invites you to listen, collaborate and make a bad thing good.\r\n\r\nBad ideas expose our own beliefs about what the criteria are for good and bad and force us to reassess. Bad ideas can go good, context is everything and ultimately bad can only be judged by the marketplace. If an idea is stupid but it works, its not stupid.\r\n\r\nSteve’s talk encourages you to be open to surprises and to capture new energy in your team by being playful with the ideas generation process and laughing as you go.\r\n\r\nShare Share +1 Email Shares 163"},{"title":"[Pt. 1] Which Methodology Should You ‘Hire’ to Apply Jobs to be Done?","url":"https://medium.com/frameplay/which-methodology-should-you-hire-to-apply-jobs-to-be-done-pt-1-f24baff27b21","body":""},{"title":"Generating Startup Ideas","url":"http://marcbarros.com/generating-startup-ideas/","body":""},{"title":"How Marketing Research Can Benefit A Small Business","url":"https://smallbiztrends.com/2006/01/how-marketing-research-can-benefit-a-small-business.html","body":""},{"title":"Growth Hacking: How to Implement an A/B Testing Model","url":"http://www.coxblue.com/growth-hacking-how-to-implement-an-ab-testing-model/","body":""},{"title":"Searching for Product/Market Fit","url":"http://www.mindtheproduct.com/2016/06/searching-product-market-fit","body":"Searching for Product/Market Fit\r\n\r\nBY CHRIS MASSEY ON JUNE 7, 2016\r\n\r\nRodrigo Madanes has got 25 years of experience designing and developing successful web and mobile products at companies such as Skype and eBay. Rodrigo will talk about exploring product/market Fit, sharing his lessons learned about first focusing on the needs of a specific user segment. Rodrigo dives into what it means to find product/market fit, some techniques for finding it, and how long it can take. By way of example: At Skype, in their early-adopter phase, they still had 40-50 million registered users. The wave can take 10-15 years, and it’s not about size of user base.\r\n\r\nHow Do You Recognise Product/Market Fit?\r\n\r\nIf you’re sensible, after launching your product you’ll spend some time searching for product/market Fit before you try and aggressively take what you believe your market to be. But working out when you have product/market fit is a tricky thing. Having a growing user base doesn’t necessarily mean that you’re solving a real problem for a defined market, or that you’ve built something that people actually want – it might just mean that you have great marketing.\r\n\r\nSize of user-base isn’t actually that helpful, so you need to try and look for other behaviours and, more importantly, more specific segments of your audience. Do you get a lot of return visitors? Do you have good Net Promoter Scores? Are your users giving you money? Do you have stable cohort retention curves? These are the signs that indicate a potential product/market fit!\r\n\r\nOnce you’ve found that fit, then you should go out and find all the people who make up that audience, and finally take the market. As observed by Marc Andreessen, a startup really has two very different phases of existence – Before Fit and After Fit – and thus two different sets of goals and behaviours. Don’t get those two mixed up.\r\n\r\nWhat Next?\r\n\r\nTaking this a step further, you need to find the specific set of features that matters to a specific, defined market, then work out exactly how to reach that market (i.e. which channels to use) and invest just in those! However, you’ll likely find, as most startups do, that although you’ll get a ramp-up in users when you hit product/market fit, your growth will gradually plateau. It’s important to remember that growth is bumpy, and as your first product/market fit growth spurt starts to slow, you should already be looking into the next set of features that will trigger another round of fit-based growth.\r\n\r\nNext, it’s important to focus on the intensity of NPS (or some other measure of user love for your product). Put simply, if you try and build something for everyone, you’ll build something that’s great for nobody. Focus on the users who really love your product, and build for them, as they’re more likely to be a defined market, and they’re more likely to help you grow.\r\n\r\nAnd finally, on the topic of defined markets, focus on specific segments of your potential audience. Realistically, your audience is a complex and multi-faceted mess of different types of people, so you need to investigate (using things like cohort analysis and segmentation) to work out exactly what defines your market (e.g. what mobile platform they’re using, location, wealth, life stages…), and then work out how to reach them.\r\n\r\nShare Share +1 Email Shares 83"},{"title":"How Does Whatsapp Make Money? Whatsapp’s Revenue Model","url":"https://www.feedough.com/how-does-whatsapp-make-money/","body":""},{"title":"Killing the Product Development Assembly Line","url":"https://hackernoon.com/killing-the-product-development-assembly-line-2176bde2a4d9","body":""},{"title":"HOW SMART LEADERS USE STORYTELLING","url":"http://templaradvisors.com/blog/how-smart-leaders-use-storytelling","body":""},{"title":"Customer Development","url":"https://www.agilealliance.org/glossary/customer-development/","body":""},{"title":"5 huge mistakes startups make when choosing board members","url":"https://venturebeat.com/2013/02/10/5-huge-mistakes-startups-make-when-choosing-board-members/","body":""},{"title":"Distribution Channel","url":"https://www.shopify.com/encyclopedia/distribution-channel","body":""},{"title":"Design Systems Sprint 0: The Silver Bullet of Product Development.","url":"https://medium.com/@marcintreder/design-systems-sprint-0-the-silver-bullet-of-product-development-8c0ed83bf00d","body":""},{"title":"Why Company Culture Is More Important Than Ever","url":"https://www.entrepreneur.com/article/247522","body":""},{"title":"4 Simple Hacks To Get People Stick Throughout Your Funnel","url":"https://blog.clickfunnels.com/attract-people-funnel-simple-hacks/","body":""},{"title":"What Is Jobs-to-be-Done?","url":"https://jobs-to-be-done.com/what-is-jobs-to-be-done-fea59c8e39eb","body":""},{"title":"User Research vs Market Research","url":"https://community.uservoice.com/blog/user-research-vs-market-research/","body":""},{"title":"What is Jobs to be Done (JTBD)?","url":"https://jtbd.info/2-what-is-jobs-to-be-done-jtbd-796b82081cca","body":""},{"title":"How to Create a Social Media Marketing Strategy in 8 Easy Steps","url":"https://blog.hootsuite.com/how-to-create-a-social-media-marketing-plan/","body":""},{"title":"How to come up with startup ideas that are worth your time","url":"https://medium.com/startup-grind/how-to-come-up-with-startup-ideas-that-are-worth-your-time-36cc54b53b5","body":""},{"title":"How to Calculate the Percent Sales Growth on an Income Statement","url":"https://smallbusiness.chron.com/calculate-percent-sales-growth-income-statement-67997.html","body":""},{"title":"What is Product Strategy? How to develop a product strategy?","url":"https://www.marketing91.com/product-strategy/","body":""},{"title":"The All-in-One Startup Funding Guide","url":"https://medium.com/startup-grind/the-startup-funding-guide-pitch-deck-term-sheets-investors-equity-crowdfunding-a212ba9cdab7","body":""},{"title":"3 Unique Ways to Increase Your Network and Generate More Leads","url":"https://medium.com/@joe_fairless/3-unique-ways-to-increase-your-network-and-generate-more-leads-7f0d6cadee97","body":""},{"title":"The Basics of Customer Development for New Entrepreneurs","url":"https://medium.com/get-greenlit/the-basics-of-customer-development-for-new-entrepreneurs-5647f0ca37ff","body":""},{"title":"Do You Really Need Passion to Launch a Startup? The Answer May Surprise You","url":"http://FI.co/posts/22201","body":"When getting ready to embark on a major endeavor - whether it be personal, professional, or otherwise - passion is frequently touted as a prerequisite quality to have. And while passion for an idea or ideal is generally considered a requirement for launching a startup, is it really as necessary as founders think?\r\n\r\nIn this syndicated post, Benjamin Chong, a Partner at Right Click Capital and Co-Director of the Sydney Founder Institute, explains why following your passion is an admirable yet misguided notion, and what founders should strive for instead.\r\n\r\nThe post, \"Is it all about passion?\", originally appeared on Benjamin Chong's Blog and has been republished below with permission.\r\n\r\nPassion makes for success. Without passion you’ll fail. If you don’t have passion about what you’re doing, you won’t do it for long. We’ve all heard these catch phrases, and while they sound good, I’ve had a niggling suspicion in the back of my mind that it doesn’t always work that way. I’ve seen salesmen with loads of passion fail in closing deals. I’ve seen actors with passion for their craft fail in getting work. I’ve seen speakers who are passionate about a cause fail to mount cogent arguments.\r\n\r\nWhile I was growing up, my parents sent me to music lessons. Every week, I remember going to my piano teacher’s studio where she’d have me play scales and pieces I had practiced during the week. On weeks where I had slacked off, my teacher would ask if I had practiced. I’d say “yes”, to which she’d reply, “I can hear you haven’t practiced this week”. If, as a kid, you’d asked me whether I was passionate about music, I don’t think my answer would have been a resounding yes, but as the years of practice added up, I got better and better, and while I’m certainly no concert pianist, I now say I’m passionate about music in general, and piano music in particular.\r\n\r\nCal Newport’s book, So Good They Can’t Ignore You, deals with this very topic. He dispels the popular concept that you need to find your passion before you launch your career. Instead, he spells out the importance of following four simple rules that’ll put you on the right trajectory. Each of these rules isn’t revolutionary, but when combined, they make up a sensible and coherent action plan no matter what your career.\r\n\r\nThe first rule is don’t follow your passion. In this section, Cal strongly argues following your passion is bad advice, especially when you’re passionate about a field you have limited experience with.\r\n\r\nIn this section, Cal strongly argues following your passion is bad advice, especially when you’re passionate about a field you have limited experience with. The second rule is be so good that they can’t ignore you. Here, Cal puts forward a number of examples of successful individuals who have honed their skills through deliberate practice. He recalls the 10,000 hour rule made famous by Malcolm Gladwell’s book,Outliers, whereby those who are experts in the field, be it music, sport, or business have spent 10,000 hours developing their craft.\r\n\r\nHere, Cal puts forward a number of examples of successful individuals who have honed their skills through deliberate practice. He recalls the 10,000 hour rule made famous by Malcolm Gladwell’s book,Outliers, whereby those who are experts in the field, be it music, sport, or business have spent 10,000 hours developing their craft. The third (slightly cryptic) rule is turn down a promotion. Cal argues it’s important for skilful people to be deliberate about how and where they direct their efforts. Control here is key, as is having the freedom to take little bets in exploring and experimenting with areas of interest. He also stresses the importance of continual improvement noting that so many people stop learning and stretching themselves once they’ve found a comfortable job.\r\n\r\nCal argues it’s important for skilful people to be deliberate about how and where they direct their efforts. Control here is key, as is having the freedom to take little bets in exploring and experimenting with areas of interest. He also stresses the importance of continual improvement noting that so many people stop learning and stretching themselves once they’ve found a comfortable job. The fourth rule is think small, act big. In this section, Cal provides examples of other successful people who have ‘discovered’ their big and challenging missions after they’ve developed a high level of domain knowledge and cultivated rare skills. One of my favourite quotes of this section is “working right trumps funding right work”.\r\n\r\nAfter reading So Good They Can’t Ignore You, I can see parallels in my own life. My passion for music seems to have come about repeated and deliberate (at least on my parents’ part) exposure from a young age. I received ongoing encouragement with provided additional motivation to practice more, becoming more confident and playing (and enjoying) different genres. In other fields, I’m now more motivated to spend time deliberately practicing and developing my skills, applying some of the author’s other rules.\r\n\r\n(Man showing a red heart shaped box image by StockUnlimited)"},{"title":"What Employees Want From the Performance Management Process","url":"https://www.td.org/insights/what-employees-want-from-the-performance-management-process","body":""},{"title":"What Do Boards Actually Do?","url":"https://bothsidesofthetable.com/what-do-boards-actually-do-9c278e81da5f","body":"What Do Boards Actually Do?\r\n\r\nThere’s a lot of mystique about what happens at board meetings and a lot of imagined board-room drama. I read commentary or Twitter or blogs and realize that there are also strongly held convictions that there are these evil VCs who do terrible things to mostly altruistic founders.\r\n\r\nThe image of boards and of investors vs. founder conflicts has been so at odds with my experiences on dozens of boards over the past 20 years that I thought it was worth sharing what I actually see.\r\n\r\nAs a starting point the board is intended to have legal and financial responsibilities to a few key constituencies: shareholders, debt holders, creditors, employees, government and major parties with whom the business operates.\r\n\r\nIn some ways being a board member is like how I’ve heard people describe learning to become a pilot: Many hours of boredom followed by some brief moments of absolute panic and fear. In fact, as one Twitter commenter observed to what do board do, “Often, not much.” That’s true. Executives run the day-to-day so often the board is more involved as a sparring partner at key intervals.\r\n\r\nThe administrative work we actually do at board meetings?\r\n\r\nAgreeing an annual budget\r\n\r\nSetting a 409a valuation used to price stock options\r\n\r\nAgreeing stock option allocations\r\n\r\nReviewing financial performance\r\n\r\nTalking about the organizational structure and where we need to bolster things\r\n\r\nDiscussing sales \u0026 marketing strategies, product launches, technical challenges\r\n\r\nTalking about law suits (patents, trademarks, employee disputes)\r\n\r\nAnd so forth\r\n\r\nBetween board meetings we do calls to discuss performance or major initiatives. Often we are asked to get involved in executive-level recruiting. And of course we help with business development introductions and with fund raising events.\r\n\r\nBoard work does involve a lot of conflict at moments throughout the company. Sometimes conflict comes because a company isn’t hitting its expected targets and investors vs. executives have different views in the causes or the consequences of under-performance. Sometimes conflict comes because executives want to increase personal compensation and investors aren’t in favor of this. Sometimes it comes because investors believe the company needs more experienced leadership to run the company or more often to help run the company.\r\n\r\nBut unlike the popular press reporting of this conflict — 80% of the time it is founder-to-founder conflict and not investor-to-founder conflict. The overwhelming majority of conflicts that I’ve seen on boards over the years are a result of the tensions of either:\r\n\r\nunderperformance of a company in which executives blame the action of each other or specific individuals\r\n\r\nfounders or senior executives in a company upset that they don’t have the right role, title or compensation\r\n\r\norganizational changes in a company initiated by the CEO that leaves somebody in the company being unhappy\r\n\r\ndifferent risk expectations founders have with each other: Raise more vs. raise less, engage in M\u0026A vs. fund raise, grow faster with higher burn or cut costs and focus on profitability, etc.\r\n\r\nIn nearly 20 years of sitting on boards I have seen:\r\n\r\nFounders trying to fire other co-founders\r\n\r\nCompanies revolting against the founder \u0026 CEO and asking for the board’s help\r\n\r\nFounders physically threatening other co-founders or employees\r\n\r\nSubstance abuse\r\n\r\nMajor problems with depression and dysfunction at the executive level\r\n\r\nOf course I’m not saying most founders have problems — I’m just pointing out that when you’re involved with scores of companies you see every kind of human behavior. But importantly non-founders who are often major contributors to the success of a company and would be interested to know that it’s not unheard of to see founders\r\n\r\nAsk for major top-ups of their personal equity while not having commensurate top-ups for rank-and-file executives\r\n\r\nMajor squandering of company resources on travel \u0026 entertainment that isn’t in support of company goals\r\n\r\nProfligate spending with limited regard for future fund raising that causes major dilution when funds are raised at the last minute\r\n\r\nI point out the worst that I’ve seen in 20 years for a reason. Boards are not appointed to be founder-friendly lapdogs for the 1–3 founders who start companies and usually own the largest equity positions in the company. Boards are fiduciaries to represent the interest of all shareholders — big and small — and this includes employees who bet with their careers and with reduced pay in order to have equity they hope will be valuable.\r\n\r\nTo be clear — most founders I’ve ever worked with have been super ethical, very conscientious, not overly greedy and take their personal responsibilities very seriously. I also want to be clear that some investor board members can act like total jerks at times.\r\n\r\nI am usually loyal to the founders I’ve backed above all else. I consider myself founder friendly. I will work evenings or weekends to help a founder in need. I prefer to leave the passionate, mission-driven founder in charge for as long as is possible. If the founder has limitations in running a company I will normally try any other option other than removing them from the CEO role. And if I believe they aren’t the best suited person to run the company I will always sit down and walk the founder through why I believe the company might be better suited with somebody else at the helm. I will see if I can get him or her to see this herself.\r\n\r\nBut in the end — a board’s ultimate loyalty must be to the company and all of its shareholders. The board is there to represent the interests of all shareholders \u0026 creditors and to put the interests of the company before their own interests. At times being “founder friendly” can mean protecting many founders from a CEO or it can even mean providing tough guardrails to protect a CEO’s own personal interests from his or her worst instincts. I saw this first hand with a CEO who tried to get into numerous company-betting lawsuits that we knew weren’t in his best interest.\r\n\r\nWhat prompted this post? It has nothing to do with any individual company. I have been meaning to write this for a while as I’ve noticed that much of my board time is involved in trying to be an independent referee for founders who themselves are trying to resolve their own conflicts. Those seldom get reported.\r\n\r\nThe rise of crowd funding saw the first wave of founders gleeful that they could raise capital without having to deal with terrible VCs. I think we’re far enough into this trend to see that having strong board members — including VCs — is a healthy alternative to party-rounds of crowd funding with no oversight.\r\n\r\nLately I’ve noticed that there is a second wave that many fantasize about a world in which ICOs drive all funding and founders and employees never have to deal with venture capitalists. ICOs certainly have a place in startup financing.\r\n\r\nBut having a board of directors and having some of those board members be large financial owners in the business with shared corporate governance forces a tension in businesses that I believe is healthy. This is similar to the role that public markets play in helping shape publicly traded companies. At times I’m sure it feels terrible to be a publicly traded company but ultimately I believe the sunshine of publicly reported numbers produces better results. So, too, a healthy and skeptical board.\r\n\r\nPhoto credit: jpeepz via VisualHunt / CC BY-NC"},{"title":"Never, Ever Compromise: Hiring For Culture Fit","url":"http://blog.eladgil.com/2012/04/never-ever-compromise-hiring-for.html","body":""}]